Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: GIO can provide extensive information about files and folders, including the MIME type and icon of a file and which applications can be used to open a file. Since the GVFS uses the standard from <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> to determine file types and associations, it works correctly on different free desktop environments, helping independent software developers create software that can be run in different environments.
ja: GIO はファイルやフォルダにたいして、MIME 型やファイルのアイコン、どのアプリケーションがそのファイルを開くことができるかといった広範な情報を提供します。GVFS がファイルタイプの決定と関連付けの標準として <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> に採用されて以来、GVFS は異なるデスクトップ環境で正常に動作するようになり、開発者が異なる環境で実行されるソフトウェアを作成する助けとなりました。

source: GIO is used throughout the GNOME desktop. The file manager, <application>Nautilus</application>, uses GIO to display folders on local and remote systems. For the user, this means that network servers act just like local folders: They can drag and drop files between them, view the files' properties, and open the file with an application. Using GIO will allow your application to open all the files that users can access on their desktop.
ja: GIO は GNOME デスクトップを通じて使用されます。ファイルマネージャである <application>Nautilus</application> はローカルおよびリモートのフォルダの表示に GIO を使用します。ユーザにとってこれは、ネットワークサーバがあたかもローカルのフォルダであるかのように機能することを意味します: ユーザはこれらの間で、ファイルのドラッグアンドドロップ、プロパティ参照、アプリケーションからファイルを開くことができます。アプリケーションで GIO を使用することにより、ユーザがデスクトップからアクセスすることができる、すべてのファイルを開くことが可能になります。

source: For more information on GIO, see the <ulink url="http://library.gnome.org/devel/gio/stable/">GIO Reference Manual</ulink>.
ja: GIO についての詳細は <ulink url="http://library.gnome.org/devel/gio/stable/">GIO Reference Manual</ulink> を参照してください。

source: In previous versions of GNOME, the GnomeVFS library was used for access to files and folders. While GnomeVFS provided many of the same features, including transparent access to remote folders, it had a number of limitations which have been addressed in GIO. GnomeVFS is deprecated and should not be used in newly written code, although it will continue to be supported throughout the GNOME 2 lifetime. For information on GnomeVFS, see <ulink url="http://library.gnome.org/devel/gnome-vfs-2.0/stable/">GnomeVFS - Filesystem Abstraction Library</ulink>.
ja: GNOME の以前のバージョンでは、GnomeVFS ライブラリがファイルおよびフォルダへのアクセスに使用されていました。 GnomeVFS でもリモートフォルダへの透過的アクセスを含めた同様な機能が提供されていましたが、いくつかの制限もあり、それは GIO によって解決されました。GnomeVFS は GNOME 2 でも引き続きサポートされますが使用は推奨されていないので、新しく記述するコードで使用するべきではありません。GnomeVFS についての詳細は <ulink url="http://library.gnome.org/devel/gnome-vfs-2.0/stable/">GnomeVFS - Filesystem Abstraction Library</ulink> を参照してください。

source: Configuration and Lockdown
ja: コンフィギュレーションとロックダウン

source: GConf is the system for storing and retrieving configuration settings in GNOME. GConf consists of two parts: a client library for accessing settings, and a session daemon which is responsible for the details of storing and retrieving those settings. Using a daemon allows GConf to use different storage backends, validate input, and provide simultaneous access to different applications.
ja: GConf は GNOME のコンフィギュレーション設定を保存および取得するシステムです。GConf は2つのパートからなります:設定にアクセスするためのクライアントライブラリと、それらの設定の保存および取得を受け持つセッションデーモンです。デーモンを使用することにより GConf は、異なるストレージをバックエンドとする、入力をチェックする、同時に複数のアプリケーションからのアクセスを可能にする、などのことができるようになります。

source: Settings stored in GConf are stored and retrieved using a unique key, or identifier string. Keys use a simple hierarchical namespace to avoid collision among settings for applications and the desktop. You can provide a schema file to detail your configuration keys. This allows GConf to validate the type of the input, and to show localized documentation about the key. This helps systems administrators, who can set multiple settings at once without having to navigate preference dialogs.
ja: GConf により保存された設定は、ユニークなキーもしくは識別文字列を使用して保存・取得します。キーは単純な階層による 名前空間を使用することにより他のアプリケーションやデスクトップの設定との衝突を避けいています。あなたはンフィギュレーション・キーの詳細をスキーマファイルとして提供することができます。これによりGConf はキーの入力タイプの確認、そしてキーにたいするローカライズされたドキュメントを表示することができます。またシステム管理者はこれにより、複数の設定を設定ダイアログを操作せずに一度で設定することができます。

source: GConf can look up settings from different settings at once, typically from different locations on the file system. By having appropriate system sources configured, GConf enables systems administrators to provide both default and mandatory settings for all users. Tools such as GNOME's <application>Configuration Editor</application> and <application>Sabayon</application> make it easy to deploy fully configured systems using GConf.
ja: GConf は異なる設定を一度に参照することができます。典型的な例は異なる場所のファイルシステムの参照です。システムソースを適切に設定することにより、GConf はすべてのユーザにたいする既定・必須の設定を適用することができます。GNOME の <application>設定エディタ (Configuration Editor)</application> や <application>プロファイル・エディタ (Sabayon)</application> のようなツールはGConf で設定されたシステムへのデプロイ作業を容易にします。

source: The GConf client library provides notifications of changes to settings, making it easy to provide instant-apply settings in your application, regardless if settings are changed from within your application or using another tool. Setting the value of a key will notify all interested applications, allowing desktop-wide and other cross-application settings to work instantly and effortlessly.
ja: GConf のクライアントライブラリは設定の変更にたいする通知を提供します。それにより他のツールからアプリケーションの設定が変更された場合でも、変更された設定をアプリケーションに即時に適用することが容易になります。キーにたいする値の設定は、それに興味を持つすべてのアプリケーションに通知され、デスクトップや他のアプリケーションにまたがる設定を素早く簡単に処理することができます。

source: GConf makes it easy to lock down systems by setting particular keys read-only, preventing users from changing their values. In addition, GNOME provides a number of high-level keys that can be used to disable actions such as saving to disk and changing the panel layout. Tools such as <application>Pessulus</application> make it easy for administrators to find and lock down important keys.
ja: GConf は特定のキーを読み取り専用に設定にして、ユーザが値を変更できないようにすることによりシステムのロックダウンを容易にします。さらに GNOME はディスクへの保存やパネルのレイアウト変更を禁止するために使用できる高レベルのキーをいくつか提供しています。<application>ロックダウン・エディタ (Pessulus)</application> のようなツールは管理者が重要なキーを探してロックダウンするのを容易にします。

source: You should use GConf to store all user preferences in your application. Using GConf will make it easy to provide instant-apply preferences, and it will make your settings accessible to systems administrators and configuration and backup tools.
ja: あなたのアプリケーションがすべてのユーザの設定を保存するような場合は GConf を使用すべきです。GConf を使用することにより即時に適用が可能な設定を提供でき、システム管理者や設定、バックアップツールから設定にアクセスすることが可能になります。

source: For more information on GConf, see the <ulink url="http://library.gnome.org/devel/gconf/stable/">GConf Reference Manual</ulink>.
ja: GConf についての詳細は、 <ulink url="http://library.gnome.org/devel/gconf/stable/">GConf Reference Manual</ulink> を参照してください。

source: Internationalization
ja: インターナショナライゼーション

source: The GNOME Desktop and Developer Platform provides full support for internationalizing and localizing applications. Internationalization is the process of ensuring your application can be localized, including marking all strings for translations, using numbers and format strings correctly, and making adjustments for variations in conventions for times and dates, units, and formatting.
ja: GNOME デスクトップと開発者用プラットフォームはアプリケーションをインターナショナライズ(訳注: 異なる言語環境において機能するソフトウェアをデザインすること)、ローカライズ(訳注: 実際にアプリケーションのメッセージやラベル、その他のインタフェース要素を異なる言語に翻訳すること)へのフルサポートを提供します。インターナショナライゼーションはあなたのアプリケーションがローカライズできることを保証するためのプロセスです。そのローカライズには、アプリケーションで翻訳されるすべての文字列をマークすること、その文字列にたいして番号と書式を正しくマーキングすること、そして時刻や日付、単位や書式にたいする慣習の違いの調整などが含まれます。

source: GNOME uses the standard gettext and related routines for accessing localizations. Support for localization using gettext is built into every component of the GNOME platform. Your source code can be scanned for specially-marked tools by automated tools. Those strings are then placed in PO files to allow translators to track their translations. Using gettext, you can easily and efficiently access translated versions of all user-visible strings in your application from translation domains installed along with your application.
ja: GNOME はローカライゼーションの機能にアクセスするために、標準の gettext と関連するルーチンを使用します。gettext を使用したローカライゼーションへのサポートは、GNOME プラットフォームのすべてのコンポーネントに組み込まれています。あなたのソースコードは特別なツールのために、自動化されたツールによってスキャンされます。それらの文字列は PO ファイルの中に配置され、翻訳者が翻訳を追跡できるようにします。gettext を使用することにより、あなたは簡単かつ効果的に実際にユーザが目にする翻訳されたバージョンの文字列、つまりアプリケーションがインストールされた翻訳ドメインにしたがって翻訳された文字列にアクセスすることができます。

source: These translation domains can be created using PO files, which can be used by translators to track string changes and update their translations accordingly. GNOME ships with intltool, a tool for managing translations in PO files. Using intltool, translators can use PO files to translate not only the strings in your application, but also other types of files that you use, such as GConf schema files, desktop entry files, and XML files.
ja: これらの翻訳ドメインは、文字列の変更を追跡し、翻訳のための更新を適宜行うことができる PO ファイルを使うことにより作り出すことができます。GNOME には intltool という、PO ファイルの中の翻訳を管理するためのツールが付属しています。intltool を使用することにより、アプリケーション中の文字列の翻訳だけではく、GConf のスキーマファイルやデスクトップのエントリファイル、そして XML ファイルにも PO ファイルを使用することができます。

source: GNOME also provides the xml2po tool as part of the gnome-doc-utils package. This tool allows translators to use PO files to create translated versions of documentation written in various XML formats, including XHTML and DocBook.
ja: GNOME は gnome-doc-utils パッケージの一部として xml2po ツールも提供します。このツールにより翻訳者は PO ファイルから XHTML、DocBook を含めたさまざまな形式の翻訳済み XML を作成することができます。

source: Internationalization involves more than just allowing strings to be translated, and GNOME supports your application development at every step of the process. GTK+ will automatically adjust its presentation for languages that are read right-to-left, and Pango has complete support for rendering bidirectional text and text in various different writing systems. GTK+ supports multiple input methods, allowing users from all language to input text efficiently with their keyboards. The entire GNOME platform uses the UTF-8 encoding of Unicode natively, providing access to the characters and writing systems of the entire world.
ja: インターナショナライゼーションにはは文字列が翻訳されることを可能にするだけでなく、あなたのアプリケーションを開発するときに、インターナショナライゼーション・プロセスの各ステップを GNOME サポートするということが含まれています。GTK+ は右から左に読むような言語の表示を自動的に調整し、Pango は両方向から読むようなテキストや、さまざまな異なる書記体系で記述されたテキストを完全にサポートします。GTK+ は複数の入力メソッドをサポートし、すべての言語のユーザが自身のキーボードでテキストを効果的に入力することを可能にします。GNOME プラットフォーム全体では Unicode の表記法の1つである UTF-8エンコードをネイティブでサポートし、全世界の文字と書記体系へのアクセスを提供します。

source: <application>Gnumeric</application> in Multiple Languages
ja: 複数言語による <application>Gnumeric</application>

source: Screenshots of the <application>Gnumeric</application> spreadsheet application running in Hebrew, Japanese, and Serbian.
ja: スプレッドシート・アプリケーションである <application>Gnumeric</application> でヘブライ語、日本語、セルビア語を実行したときのスクリーンショット。

source: Internationalizing your application helps make it available to many more users across the world. While skilled translators must provide translations for any language, programmers must ensure the application is properly internationalized before it can be fully localized.
ja: あなたのアプリケーションをインターナショナライズすることは、世界中の多くのユーザがアプリケーションを使用する手助けとなります。経験を積んだ翻訳者がいくつもの言語への翻訳を提供しなければならない間、アプリケーションが完全にローカライズされるまでは、アプリケーションがインターナショナライズされていることをプログラマは保証しなければなりません。

source: For more information on internationalization in GNOME, see <ulink url="http://www.gnome.org/~malcolm/i18n/">Internationalizing GNOME Applications</ulink>.
ja: GNOME のインターナショナライゼーションについての詳細は <ulink url="http://www.gnome.org/~malcolm/i18n/">Internationalizing GNOME Applications</ulink> を参照してください。

source: Accessibility
ja: アクセシビリティ

source: Accessibility is the process of ensuring your application can be used by people with various disabilities. Disabilities come in many forms: visual impairments, movement impairments, hearing impairments, cognitive and language impairments, and seizure disorders. Many people have some sort of disability, and making your application accessibility will allow more people to use your application effectively.
de: Die Barrierefreiheit stellt sicher, dass Ihre Anwendung von Benutzern mit verschiedenen Behinderungen verwendet werden kann. Behinderungen gibt es in verschiedenen Formen: visuelle Einschränkungen, Bewegungseinschränkungen, Schwerhörigkeit/Gehörlosigkeit und Anfallsleiden. Viele Leute haben solche Behinderungen, und die Sicherstellung der Barrierefreiheit für Ihre Anwendung macht diese für mehr Benutzer effektiver zugänglich.
ja: アクセシビリティとは。あなたのアプリケーションをハンディキャップを持つさまざまな人が使えるよう保証するプロセスのことです。ハンディキャップはさまざまな形をとります: 視力障害、運動機能障害、聴覚障害、認知機能、および言語障害、そして発作障害などです。なんらかのハンディキャップをもつ人々が多数存在し、あなたのアプリケーションのアクセシビリティは、それら多くの人々がアプリケーションを効果的に使用することを可能にします。

source: GNOME provides support for accessibility devices using the ATK framework. This framework defines a set of interfaces to which graphical interface components adhere. This allows, for instance, screen readers to read the text of an interface and interact with its controls. ATK support is built into GTK+ and the rest of the GNOME platform using the GAIL library, so any application using GTK+ will have reasonable accessibility support for free.
ja: GNOME は ATK フレームワークを使用することによりアクセシビリティのためのデバイスのサポートを提供します。このフレームワークはグラフィカル・インタフェースのコンポーネントと密接に結びついたいくつかのインタフェースを定義します。これによりたとえば、スクリーンリーダーはインタフェースのテキストを読み上げ、インタフェスのコントロールと相互作用を行うことができます。ATK のサポートは GTK+ に組み込まれており、残りの部分は GNOME プラットフォームでは GAIL ライブラリが使用されます。そのため GTK+ を使用する任意のアプリケーションは、何ら苦労することなく妥当なアクセシビリティのサポートを提供することができます。

source: Nonetheless, you should be aware of accessibility issues when when developing your applications. Although GTK+ interfaces provide reasonable accessibility by default, you can often improve how well your program behaves with accessibility tools by providing additional information to ATK. If you develop custom widgets, you should ensure that they expose their properties to ATK. You should also avoid using sound, graphics, or color as the sole means of conveying information to the user.
de: Nichtsdestotrotz sollten Sie beim Entwickeln von Anwendungen die Barrierefreiheit im Auge behalten. Obwohl die GTK+-Schnittstellen schon vernünftige Schnittstellen standardmäßig bereitstellt, können Sie doch die Barrierefreiheit Ihres Programms weiter verbessern, indem Sie ATK zusätzliche Informationen zur Verfügung stellen. Falls Sie eigene Widgets entwickeln, stellen Sie bitte sicher, dass deren Eigenschaften an ATK übermittelt werden. Sie sollten auch vermeiden, Klänge, Grafiken oder Farben als grundlegende und alleinige Informationselemente für den Benutzer zu verwenden.
ja: それにもかかわらず、あなたはアプリケーションを開発するときはアクセシビリティの問題点を知っているべきです。GTK+ のインタフェースが妥当なアクセシビリティを既定で提供するとしても、ATK に対して追加の情報を与えることでアクセシビリティツールに対するあなたのアプリケーションの振る舞いを改善できることがあります。もしあなたが独自のウィジェットを開発する場合、それらのプロパティを ATK から使用できるよう保証すべきです。また、ユーザに情報を伝える際はサウンド、グラフィクス、色などのうちのどれか1つだけに頼るべきではありません。

source: The GNOME desktop ships with a number of accessibility tools which enable users with disabilities to take full advantage of their desktop and applications. Applications that fully implement ATK will be able to work with the accessibility tools. GNOME's accessibility tools include a screen reader, a screen magnifier, an on-screen keyboard, and <application>Dasher</application>, an innovative predictive text entry tool.
ja: GNOME デスクトップにはハンディキャップを持つ人々がデスクトップやアプリケーションを最大限有効に使用することを可能にするためのいくつかのアクセシビリティツールが付属しています。ATK をフルに実装したアプリケーションはアクセシビリティツールと協調して動作します。GNOME のアクセシビリティツールにはスクリーン・リーダー、スクリーン拡大鏡、オンスクリーン・キーボード、そしてグラフィカルな事前予測テキスト入力システムである <application>Dasher</application> が含まれます。

source: For extensive recommendations on accessibility, see <ulink url="http://developer.gnome.org/projects/gap/guide/gad/index.html">GNOME Accessibility for Developers</ulink>. See also <ulink url="http://library.gnome.org/devel/atk/stable/">ATK - Accessibility Toolkit</ulink> and the <ulink url="http://library.gnome.org/devel/gail-libgail-util/stable/">GAIL Reference Manual</ulink>.
ja: アクセシビリティについてのさらに広範な推奨については <ulink url="http://developer.gnome.org/projects/gap/guide/gad/index.html">GNOME Accessibility for Developers</ulink> を参照してください。また <ulink url="http://library.gnome.org/devel/atk/stable/">ATK - Accessibility Toolkit</ulink> と <ulink url="http://library.gnome.org/devel/gail-libgail-util/stable/">GAIL Reference Manual</ulink> も参照してください。

source: Multimedia
ja: マルチメディア

source: GStreamer is a powerful multimedia library for playing, creating, and manipulating sound, video, and other media. You can use GStreamer to provide sound and video playback, record input from multiple sources, and edit multimedia content. GStreamer supports encoding and decoding numerous formats by default, and support for additional formats can be added with plug-ins.
de: GStreamer ist eine mächtige Multimedia-Bibliothek zur Wiedergabe, Erzeugung und Bearbeitung von Klängen, Video und anderen Medien. Sie können GStreamer zur Wiedergabe von Klang und Video, Aufnahmen aus verschiedenen Quellen und Bearbeiten von Multimedia-Inhalten verwenden. GStreamer unterstützt bereits die Kodierung und Enkodierung verschiedener Formate. Die Unterstützung für weitere Formate kann über Plugins erfolgen.
ja: GStreamer はサウンド、ビデオ、その他のメディアを再生・作成・操作するための強力なマルチメディア・ライブラリです。GStreamer を使用することによりサウンドとビデオの再生、複数ソースからの記録、そしてマルチメディア・コンテンツの編集ができます。GStreamer は既定でいくつかの形式に対するエンコード・デコードをサポートします。その他の形式についてはプラグインにより追加することができます。

source: GStreamer provides a flexible architecture wherein media is processed through a pipeline of elements. Each element may apply filters to the content, such as encoding or decoding, combining multiple sources, or transforming the multimedia content. This architecture allows for an arbitrary arrangement of elements, so that you can accomplish virtually any effect using GStreamer. Furthermore, GStreamer is designed to have low overhead, so it can be used in applications with high demands on latency.
de: GStreamer stellt eine flexible Architektur bereit, in der Mediendaten innerhalb einer Pipeline aus Elementen verarbeitet werden. Jedes Element kann Filter auf die Inhalte anwenden, wie Enkodierung oder Dekodierung, Zusammenführen mehrerer Quellen, oder Umwandeln des Multimedia-Inhalts. Diese Architektur erlaubt eine willkürliche Anordnung der Elemente, so dass Sie virtuell jeden beliebigen Effekt in GStreamer verwirklichen können. Außerdem wurde GStreamer auf geringen Verschnitt hin entworfen, so dass es in Anwendungen mit hohen Anforderungen an die Latenzzeit genutzt werden kann.
ja: GStreamer はメディアをエレメントのパイプラインを通して処理する柔軟なアーキテクチャを提供します。それぞれのエレメントにはエンコード、デコード、複数ソースの合成、マルチメディアの変換などの、コンテンツにたいするフィルターを適用することができます。このアーキテクチャによりエレメントに任意の引数を指定することができるので、GStreamer を使ってさまざまなバーチャル・エフェクトを実現することができます。そのうえ、GStreamer はオーバーヘッドが低くなるようデザインされているので、潜在的に高い負荷を持つアプリケーションと実行することができます。

source: While GStreamer provides a powerful API for manipulating multimedia, it also provides convenient routines for simple playback. GStreamer can automatically construct a pipeline to read and playback files in any supported format, allowing you to use sound and video in your application easily.
de: GStreamer bietet nicht nur eine mächtige API für die Manipulation von Multimediadaten, sondern auch bequeme Routinen für die einfache Wiedergabe. GStreamer kann automatisch eine Weiterleitung konstruieren, um Dateien in jedem unterstützten Format zu lesen und wiederzugeben. Dies erlaubt Ihnen in Ihrer Anwendung die einfache Nutzung von Klang und Video.
ja: GStreamer はマルチメディアを取り扱うための強力な API を提供します。また、その API は単純な再生のための便利なルーチンも提供します。GStreamer はあなたのアプリケーションで簡単にサウンドやビデオを使用するために、サポートしている形式のファイルを読み込み再生するためのパイプラインを自動的に構築することができます。

source: The GStreamer architecture allows plugins to add encoders, decoders, and all sorts of content filters. Third-party developers can provide GStreamer plugins which will be automatically available to other applications using GStreamer. Plugins can provide support for other multimedia formats or provide additional functionality and effects.
de: Die GStreamer-Architektur ermöglicht es, mittels Plugins Encoder und Decoder einzubinden sowie den Inhalt auf alle erdenklichen Arten zu filtern. Drittanbieter können GStreamer-Plugins bereitstellen, die über dann automatisch auch für alle Anwendungen verfügbar sind, die GStreamer nutzen. Plugins können der Unterstützung weiterer Multimediaformate dienen oder zusätzliche Funktionen und Effekte bereitstellen.
ja: GStreamer のアーキテクチャにより、エンコーダ、デコーダ、そしてすべての種類のコンテンツのフィルタをプラグインにより追加することができます。サードパーティはGStreamer を使用する他のアプリケーションから自動的に使用可能になる GStreamer のプラグインを提供することができます。プラグインではほかのマルチメディア形式や追加の機能や効果の追加を提供できます

source: You should use GStreamer whenever you need to read or play multimedia content in your application, or if your application needs to manipulate sound or video. Using GStreamer makes your application development easy, and it provides you well-tested elements for many of your needs.
de: Sie sollten GStreamer verwenden, wann immer es in Ihrer Anwendung notwendig ist, Multimedia-Inhalte zu lesen oder wiederzugeben, oder wenn Ihre Anwendung Klänge oder Video bearbeiten soll. GStreamer erleichtert Ihre Anwendungsentwicklung und stellt umfassend getestete Elemente für viele Anwendungsfälle bereit.
ja: あなたのアプリケーションでマルチメディアのコンテンツを読み込んだり再生する必要がある場合や、サウンドやビデオを取り扱う必要がある場合は GStreamer を使用するべきです。GStreamer を使用することによりあなたのアプリケーションを開発することが簡単になり、GStreamer が提供する充分にテストされたエレメントをあなたの必要に応じて使用することができます。

source: For comprehensive information on GStreamer, see <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">The GStreamer Application Development Manual</ulink>, <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">The GStreamer 0.10 Core Reference Manual</ulink>, and <ulink url="http://gstreamer.freedesktop.org/documentation/">the GStreamer documentation page</ulink>.
ja: GStreamer についてのわかりやすい情報は <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">The GStreamer Application Development Manual</ulink>、<ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">The GStreamer 0.10 Core Reference Manual</ulink>、および <ulink url="http://gstreamer.freedesktop.org/documentation/">the GStreamer documentation page</ulink> を参照してください。

source: Printing
ja: 印刷

source: Most applications need to provide support for printing. Users expect to be able to print the contents they can view on-screen. The GNOME platform provides libraries to help you add support for high-quality printing to your application.
ja: 印刷にたいするサポートを提供する必要のあるアプリケーションは多数存在します。ユーザはスクリーンに表示される内容と同様のものが印刷できることを期待します。GNOME プラットフォームはあなたのアプリケーションで高品質な印刷をサポートするためのライブラリを提供します。

source: GNOME Print
ja: GNOME プリント

source: Note that this section is outdated and that libgnomeprint and libgnomeprintui have been deprecated in favor of <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. Printing has been integrated directly into GTK+ 2.10 and later versions, providing a cross-platform print API that all applications can use. API and ABI stability guarantees ensures that Gnomeprint will continue to be functional and supported throughout the GNOME 2 lifecycle.
ja: このドキュメントはすでに陳腐化しており、libgnomeprint と libgnomeprintui は <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink> に置き換えられていることに注意してください。印刷機能は GTK+ 2.10、およびそれ以降のバージョンでは、すべてのアプリケーションが使用できるクロスプラットフォーム対応のプリント API に直接統合されています。API と ABI の安定性は GNOME2 のライフサイクルで Gnomeprint の機能が引き続きサポートされることを保証します。

source: The GNOME print framework consists of two libraries which help you provide high-quality printing with a consistent interface in your application. At the core of the printing framework is libgnomeprint, a library for creating PostScript output to send to printers. On top of that is libgnomeprintui, which provides standard print controls for your user interface.
ja: GNOME プリントのフレームワークは、あなたのアプリケーションが統一されたインタフェースによって高品質な印刷を提供する手助けをするための2つのライブラリからなります。 プリントフレームワークの中核は PostScript の出力を生成してプリンタに送信する libgnomeprint です。その最上位に位置するのが libgnomeprintui であり、これはインタフェースのために標準的なプリント用のコントロールを提供します。
