Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: GNOME provides a unified framework for providing user documentation. You can provide documentation in the industry-standard DocBook format. Using DocBook means that you don't have to worry about formatting details. Instead, your documentation will be automatically formatted with the same consistent conventions as the rest of the system documentation.
ja: GNOME はユーザにドキュメントを提供するための統一されたフレームワークを提供します。それにより業界標準である DocBook 形式のドキュメントをユーザに提供することができます。DocBook 形式を使用することは、あなたが書式の詳細に悩む必要がないことを意味します。その代わりに、あなたのドキュメントは他のシステムドキュメントと一貫性のある規則で自動的にフォーマットされます。

source: GNOME's help viewer, <application>Yelp</application>, displays and prints documentation, provides a listing of all documentation on the system, and allows the user to search the full text of all documentation. Using the GNOME help system gives you all these features for free.
ja: GNOME のヘルプ・ビューアである <application>Yelp</application> により、ドキュメントの表示・印刷、システムのすべてのドキュメントの一覧とすべてのドキュメントにたいするテキストの検索が可能になります。GNOME のヘルプシステムにより、あなたはこれらの機能を無料で手にすることができます。

source: For more information on writing documentation for your application, see the <ulink url="http://library.gnome.org/devel/gdp-handbook/stable/">GNOME Handbook of Writing Software Documentation</ulink>, <ulink url="http://www.docbook.org/tdg/en/html/docbook.html">DocBook: The Definitive Guide</ulink>, and the <ulink url="http://library.gnome.org/devel/gdp-style-guide/stable/">GNOME Documentation Style Guide</ulink>.
ja: アプリケーションのドキュメントの記述についての詳細は <ulink url="http://library.gnome.org/devel/gdp-handbook/stable/">GNOME Handbook of Writing Software Documentation</ulink>、<ulink url="http://www.docbook.org/tdg/en/html/docbook.html">DocBook: The Definitive Guide</ulink>、 <ulink url="http://library.gnome.org/devel/gdp-style-guide/stable/">GNOME Documentation Style Guide</ulink> を参照してください。

source: @@image: 'figures/graphics.png'; md5=d7ab482cbaaf268b4c439c57b2624826
ja: @@image: 'figures/graphics.png'; md5=a63333cc92b801cc55fe62781c07999e

source: Graphical Interfaces
ja: グラフィカルなインタフェース

source: Most applications will need to provide a graphical interface to interact with users. Graphical interfaces can create an intuitive and discoverable medium for people to interact with software, and users expect applications to provide usable and attractive user interfaces.
ja: 多くのアプリケーションではユーザと対話するためにグラフィカルなインタフェースを提供する必要があります。グラフィカルなインタフェースは人間がソフトウェアと対話するときに直感的かつ発見的な手段であり、ユーザはアプリケーションが使いやすく魅力的なユーザインタフェースを提供することを期待します。

source: The GNOME Platform features sophisticated graphics and user interface technology, from standard user interface controls to an API for drawing high-quality graphics to the screen. Using the graphics technologies in GNOME allows you to create applications that are consistent, intuitive, and aesthetically pleasing.
ja: GNOME プラットフォームの特徴は洗練されたグラフィクス、およびユーザインタフェース技術であり、それは標準的なユーザインタフェースのコントロールから高品質なグラフィクスをスクリーンに描画するための API までを含みます。GNOME のグラフィクス技術を使用することにより統一感があり、直感的で、心をとらえるアプリケーションを作成することができます。

source: Layered Look at Graphics Libraries
ja: グラフィクス・ライブラリの階層

source: GTK+ is the primary library used to construct user interfaces in GNOME. It provides all the user interface controls, or widgets, used in a common graphical application. Its modern, object-oriented API allows you to construct attractive and sophisticated user interfaces without dealing with the low-level details of drawing and device interaction.
de: GTK+ ist die primäre zur Erstellung von Benutzeroberflächen verwendete Bibliothek in GNOME. Sie stellt alle Bedienelemente bereit, auch Widgets genannt, die in einer grafischen Anwendung zum Einsatz kommen. Ihre moderne, objektorientierte Schnittstelle erlaubt Ihnen die Erstellung attraktiver und kultivierter Benutzeroberflächen, ohne dass Sie sich mit den Hintergrunddetails des Zeichnens oder der Interaktion mit Geräten befassen müssen.
ja: GTK+ は GNOME においてインタフェースを構築するときの主要なライブラリです。このライブラリは一般的なグラフィカルなアプリケーションで使用されるユーザインタフェースのコントロールやウィジェットのすべてを提供します。そのモダンでオブジェクト指向の API により、描画やデバイスとの相互作用などの低レベルの詳細を処理することなく、魅力的で洗練されたユーザインタフェースを構築することができます。

source: In addition to basic widgets, such as buttons, check boxes, and text entries, GTK+ also provides powerful Model-View-Controller (MVC) APIs for tree views, multi-line text fields, and menu and toolbar actions.
de: Zusätzlich zu den grundlegenden Widgets wie Knöpfen, Ankreuzfeldern oder Texteingabefeldern stellt GTK+ auch eine mächtige Model-View-Controller-(MVC-)Schnittstelle für Baumansichten, mehrzeilige Textfelder sowie Menü- und Werkzeugleisten-Aktionen bereit.
ja: GTK+ はボタン、チェックボックス、テキスト・エントリ等の基本的なウィジェットに加え、ツリービュー、マルチラインのテキスト・フィールド、およびメニューやツールバーのアクションのためのモデル・ビュー・コントローラ(MVC)にもとづく強力なAPI を提供します。

source: Widgets in GTK+ are placed on windows using a box-packing model. Programmers specify only how to pack widgets together in container boxes, rather than position them directly with absolute coordinates. GTK+ ensures that windows are sized correctly to fit their contents, and it automatically handles window resizing.
de: Die Widgets in GTK+ werden innerhalb von Fenstern in einem Box-Anordnungsmodell platziert. Die Programmierer legen fest, wie die Widgets in Containerboxen angeordnet werden sollen, ohne dass diese direkt in unveränderliche Positionen gesetzt werden müssen. GTK+ stellt dabei sicher, dass die Fenstergrößen optimal auf deren Inhalt abgestimmt sind. Die Anpassung der Fenstergröße erfolgt dabei automatisch.
ja: GTK+ のウィジェットはウィンドウ上にボックス・パッキング・モデルで配置されます。プログラマは位置を絶対的な座標を指定して配置するのではなく、コンテナ・ボックスにウィジェットをどのようにパックするか指定するだけです。GTK+ はそれらのコンテンツを的確に配置し、ウィンドウのサイズ変更を自動的に処理することを保証します。

source: Because GTK+ offers a flexible API, developing additional widgets for use in GTK+ applications is easy. A number of third-party libraries exist which provide additional widgets, and many developers have created custom, special-purpose widgets for their applications.
de: Weil GTK+ eine über eine flexible API verfügt, ist der Entwurf zusätzlicher Widgets recht einfach. Es existiert eine Reihe von Drittanbieter-Bibliotheken, die zusätzliche Widgets anbieten. Viele Entwickler haben bereits eigene, für ihre speziellen Zwecke benötigte Widgets erstellt.
ja: GTK+ は柔軟な API を提供しているため、GTK+ のアプリケーションで追加のウィジェットを開発するのは簡単です。追加のウィジェットを提供するサードパーティによるライブラリが数多く存在し、多くの開発者が自分のアプリケーションのために、特定の目的に使用するカスタム・ウィジェットを作成しています。

source: GTK+ handles the difficult details of user interfaces and user interaction, and provides a simple yet powerful API which allows you to focus on the details of your application. Applications developed with GTK+ will automatically follow the user's theme and font settings, will interact properly with accessibility technologies, and will behave as users expect.
de: GTK+ kümmert sich um die schwierigen Einzelheiten der Benutzeroberflächen und Benutzer-Interaktionen. Eine simple und doch mächtige API erlaubt es Ihnen, sich auf die Details Ihrer Anwendung zu konzentrieren. Die mit GTK+ entwickelten Anwendungen folgen automatisch den Benutzereinstellungen für Erscheinungsbild und Schriften, arbeiten hervorragend mit Barrierefreiheits-Technologien zusammen und bieten genau dass, was der Benutzer erwartet.
ja: GTK+ がユーザインタフェースやユーザとの相互作用にまつわる難解な詳細を処理し、シンプルで強力な API を提供するので、あなたはアプリケーションの詳細に集中することができます。GTK+ を使用して開発されたアプリケーションは自動的にユーザのテーマやフォントの設定を引き継ぎ、アクセシビリティ技術と適切に対話し、ユーザの期待通りに動作します。

source: For more information on GTK+, see the <ulink url="http://library.gnome.org/devel/gtk/stable/">GTK+ Reference Manual</ulink> or visit <ulink url="http://gtk.org/">the GTK+ web site</ulink>.
ja: GTK+ についての詳細は <ulink url="http://library.gnome.org/devel/gtk/stable/">GTK+ Reference Manual</ulink> を参照するか、<ulink url="http://gtk.org/">GTK+ の Web サイト</ulink> を参照してください。

source: Note that Libglade has been deprecated in favor of <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink>. Newly written code should use GtkBuilder instead.
ja: Libglade は <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink> に置き換えられたため、使用は推奨されていないことに注意してください。新しく記述するコードでは代わりに GtkBuilder を使用するべきです。

source: Libglade is a library for constructing user interfaces dynamically from XML descriptions. You can use a graphical interface builder like <application>Glade</application> to construct your user interface, and then import the interface description into your application. This makes it easy to construct complex layouts and adjust layout details.
ja: Libglade は XML 定義からユーザインタフェースを動的に構築するためのライブラリです。あなたは <application>Glade</application> のようなグラフィカル・インタフェース・ビルダを使用してユーザインタフェースを構築して、そのインタフェース定義をアプリケーションにインポートすることができます。これにより複雑なレイアウトを構築し、レイアウトの詳細を調整することができます。

source: Libglade allows programmers to focus their code on the logic of their applications, keeping it uncluttered by the actual construction of the interface. Graphical interface builders also make it easy for dedicated interface designers to construct the interfaces without having to know how to program.
ja: Libglade によりインタフェースの構築でコードが分断されることなく、プログラマはアプリケーションのロジックに集中することができます。またグラフィカル・インタフェース・ビルダにより、デザイナはプログラムを知らずにインタフェースを構築することが簡単になります。

source: For more information on Libglade, see the <ulink url="http://library.gnome.org/devel/libglade/stable/">Libglade Reference Manual</ulink>.
ja: Libglade についての詳細は <ulink url="http://library.gnome.org/devel/libglade/stable/">Libglade Reference Manual</ulink> を参照してください。

source: The Pango layout engine can be used with different font backends and drawing backends. On most GNOME systems, Pango will use FreeType, fontconfig, and Cairo to access fonts and render text. On other systems, Pango will use the native font systems, such as Uniscribe on Microsoft Windows and ATSUI on MacOS
de: Die Pango-Layout-Engine kann mit verschiedenen Schrift- und Zeichen-Backends genutzt werden. Auf den meisten Systemen verwendet Pango dazu FreeType, fontconfig und Cairo zum Zugriff auf Schriften und Darstellen von Text. Auf anderen Systemen kommen deren Schriftsysteme zum Einsatz, zum Beispiel Uniscribe auf Microsoft Windows und ATSUI auf MacOS.
ja: Pango レイアウト・エンジンは異なるフォント・バックエンド、および描画バックエンドで使用することができます。大抵の GNOME システムでは、Pango は FreeType、fontconfig、およびフォントへのアクセスとテキストの描画に Cairo を使用します。ほかのシステムでは Pango はネイティブのフォントシステム、たとえば Microsoft Windows では Uniscribe、MacOS では ATSUI を使用します

source: Pango is the core text and font handling library in the GNOME platform. It is responsible for laying out and rendering text, and is used throughout GTK+.<placeholder-1/>
ja: Pango は GNOME プラットフォームにおいてテキストとフォントを処理する際に中核となるライブラリです。このライブラリは GTK+ を介してテキストのレイアウトとレンダリングを受け持ちます。<placeholder-1/>

source: Pango has extensive support for the various writing systems used throughout the world. Many of the writing systems used for languages have complex rules for laying out glyphs and composing characters. With Pango, nearly all languages can be written and displayed correctly, allowing users everywhere to view text in their native languages. Pango support for multiple writing systems is automatic; application developers do not have to write any special code to support other languages.
de: Pango bietet erweiterte Unterstützung für die verschiedenen Schriftsysteme, die in der Welt verwendet werden. Viele dieser Schriftsysteme haben sehr komplexe Regeln, für das Darstellen und von Zeichen und deren Verbindung untereinander. Mit Pango können beinahe alle existierenden Schriften geschrieben und korrekt dargestellt werden, was den Benutzern überall das Betrachten von Texten in ihren Muttersprachen ermöglicht. Pango unterstützt die verschiedenen Schriftsysteme automatisch. Anwendungsentwickler brauchen keinen zusätzlichen Code zu schreiben, um andere Sprachen zu unterstützen.
ja: Pango は世界中のさまざまな書記体系を広範囲にサポートします。言語により使用される多くの書記体系にはグリフのレイアウトや合成文字(composing characters)にたいする複雑なルールがあります。Pango はほとんどすべての言語による記述を正しく表示し、すべての場所でユーザがネイティブの言語でテキストを閲覧できるようにします。Pango は複数の書記体系を自動的にサポートします; アプリケーションのの開発者は他の言語をサポートするために特別なコードを記述する必要はありません。

source: Displaying Multiple Languages With Pango
ja: Pango による複数言語の表示

source: Screenshot of the <application>gedit</application> text editor displaying phrases from multiple languages and writing systems.
ja: スクリーンショットは <application>gedit</application> テキストエディタで複数の言語、書記体系によるテキストの表示です。

source: Pango supports the text styling used in typical documents and interfaces, including italics, font weights, and underlines. Pango uses a simple XML-like vocabulary called PangoMarkup which enables you to set font size, color, styles, and other text attributes. Using PangoMarkup, you can specify inline styles without manually iterating over text blocks. PangoMarkup can be used directly from GTK+, enabling you to style text in your graphical interfaces easily.
de: Pango unterstützt die in typischen Dokumenten verwendeten Textstile und Schnittstellen, wie Kursiv, Fettschrift oder Unterstreichungen. Dazu kommt ein simples XML-ähnliches Vokabular namens PangoMarkup zum Einsatz, welches Ihnen ermöglicht, Schriftgrößen, Farben, Stile und andere Textattribute anzupassen. Mit PangoMarkup können Sie beispielsweise durchgehende Stile verwenden, ohne Textblöcke manuell wieder und wieder bearbeiten zu müssen. Die Benutzung von Pango ist direkt aus GTK+ heraus möglich, was die Anpassung des Textstils in Ihren grafischen Benutzeroberflächen erheblich erleichtert.
ja: Pango は特有のドキュメントとインタフェースにより斜体、フォントの太さ、アンダーラインを含めたテキストの整形をサポートします。Pango は PangoMarkup と呼ばれる、XML に似たシンプルな言語を使用することで、フォントのサイズや色、スタイルやその他のテキストの属性を設定することを可能にします。PangoMarkup を使用することにより、テキストブロックに手動で挿入することなくインラインでスタイルを設定できます。PangoMarkup は GTK+ から直接使用され、グラフィカルインタフェースのテキストを整形するのを容易にします。

source: You should use Pango directly whenever you need to lay text out on the screen or on a different medium. Using Pango will allow your text layout to work seamlessly with GTK+ and the rest of the GNOME platform. It will help you create portable code, and most importantly, it will ensure that your application can render text correctly in hundreds of different languages.
de: Sie sollten Pango immer dann verwenden, wenn die Textdarstellung auf dem Bildschirm oder einem anderen Medium gefordert ist. Mit Pango fügt sich die Textdarstellung nahtlos in GTK+ und die übrige GNOME-Plattform ein. Pango hilft Ihnen bei der Erstellung portablen Codes. Am bedeutsamsten ist jedoch, dass Ihre Anwendung Text in Hunderten von Sprachen korrekt darstellen kann.
ja: スクリーンやその他のデバイスにテキストをレイアウトするときは常に Pango を直接使用するべきです。Pango を使用することにより GTK+ や GNOME プラットフォームの他の部分とシームレスにテキストをレイアウトすることができます。また可搬性のあるコードを記述でき、あなたのアプリケーションが異なる数百の言語を表示できることを保証します。

source: For more information on Pango, see the <ulink url="http://library.gnome.org/devel/pango/stable/">Pango Reference Manual</ulink>.
ja: Pango についての詳細は <ulink url="http://library.gnome.org/devel/pango/stable/">Pango Reference Manual</ulink> を参照してください。

source: GDK runs on a number of different platforms, including the X Window System, Microsoft Windows, DirectFB, and Quartz. On any platform, GDK provides the same consistent API, allowing GTK+ and GTK+ applications to run unmodified.
ja: GDK は X Window System、Microsoft Windows、DirectFB、Quartz を含む、いくつもの異なるプラットフォームで実行されます。それらのさまざまなプラットフォームにおいて GDK は統一された同じ API を提供することで GTK+、そして GTK+ によるアプリケーションを変更することなしに実行することを可能にします。

source: GDK is the low-level library used by GTK+ to interact with the system for graphics and input devices. Although you will rarely use GDK directly in application code, it contains all the necessary functionality to draw objects and text to the screen and to interact with the user with various input devices.<placeholder-1/>
ja: GDK は GTK+ によって使用される、グラフィクスおよび入力デバイスにたいしてシステムを通してやりとりするための低レベルなライブラリです。あなたがアプリケーションのコードで GDK を直接使用するのは稀でしょうが、このライブラリにはオブジェクトやテキストをスクリーンに描画し、さまざまな入力デバイスとやりとりするのに必要なすべての機能が含まれています。<placeholder-1/>

source: GDK features a graphics context and drawing primitives that are suitable for drawing simple objects and rendering images on the screen. Since a more extensive drawing system is provided by Cairo, GDK provides hooks to use Cairo contexts within GDK.
ja: GDK の特徴は簡単なオブジェクトの描画や、スクリーンにイメージをレンダリングするのに適したグラフィクス・コンテキストと基本的な描画機能です。Cairo により広範囲の描画システムが提供されるようになって以来、GDK は Cairo のコンテキストを使用するためのフックを提供しています。

source: GDK enables you to access events from keyboards, mice, and other input devices, rather than connect to the high-level signals used in GTK+. GDK also provides low-level routines to access drag and drop and clipboard data from the system. When implementing custom controls, you may need to access these features to implement proper user interaction behavior.
de: GDK ermöglicht Ihnen den Zugriff auf von Tastaturen, Mäusen oder anderen Eingabegeräten ausgelöste Ereignisse, im Gegensatz zu den in GTK+ verwendeten High-Level-Signalen. GDK stellt auch Low-Level-Routinen für Ziehen-und-Ablegen und die Daten in der Zwischenablage des Systems zur Verfügung. Wenn Sie eigene Bedienungsmöglichkeiten implementieren, dann dürften Sie auf diese Funktionsmerkmale zugreifen wollen, um eine saubere Interaktion mit dem Benutzer zu gewährleisten.
ja: GDK は GTK+ で使用される高レベルのシグナルによる接続ではなく、より低レベルのキーボードやマウスおよびその他の入力デバイスからのシグナルにアクセスすることを可能にします。GDK はドラッグアンドドロップやシステムのクリップボードにアクセスするための低レベルなルーチンも提供します。カスタムコントロールを実装するときは、これらのシグナルを通じたユーザとの適切なやりとりを実装するために、これらの特色の利用が必要となるでしょう。

source: GDK provides other functionality which is needed to implement a complete graphical toolkit like GTK+. Since GDK acts as a platform abstraction, allowing GTK+ to run under multiple environments, it provides an API for all of the system functionality needed by GTK+. This includes information about multi-head displays, resolution and color depth, colormaps, and cursors.
de: GDK stellt weitere Funktionalität bereit, die für die Implementation eines kompletten grafischen Werkzeugkastens wie GTK+ erforderlich ist. Weil sich GTK+ als Plattform-Abstraktion versteht, was dir Verwendung in verschiedenen Umgebungen ermöglicht, stellt es eine API für alle von GTK+ benötigte Systemfunktionalität bereit. Das schließt Informationen über die Anzeige auf mehreren Bildschirmen ein, die Auflösung und Farbtiefe, Farbpaletten und Zeiger.
ja: GDK は GTK+ のような完全なグラフィック・ツールキット実装するのに必要となる、その他の機能を提供します。GDK がプラットフォームの抽象化を提供するようになって以来、GDK は GTK+ で必要となるすべてのシステムの機能を API として提供し、GTK+ 複数の環境の元で実行できるようになりました。 これには複数のディスプレイ、解像度、カラーデプス、カラーマップ、カーソルなどが含まれます。

source: You should use GDK whenever you need low-level access to the underlying windowing system, including low-level access to events, windows, and the clipboard. Using GDK for these tasks ensures that your code is portable and integrates with the rest of your GTK+ code. The simple drawing routines in GDK should generally not be used. Instead, you should use the extensive functionality provide by Cairo.
de: Sie sollten GDK immer dann verwenden, wenn Sie Zugriff auf das darunterliegende Fenstersystem benötigen, wie beispielsweise Zugriff auf Ereignisse, Fenster oder die Zwischenablage. Die Nutzung von GDK für derartige Aufgaben stellt sicher, dass Ihr Code portierbar ist und sich in den restlichen GTK+-Code gut integriert. Die simplen Zeichenroutinen in GDK sollten nicht verwendet werden. Stattdessen sollten Sie die erweiterte Funktionalität nutzen, die Cairo zur Verfügung stellt.
ja: イベント、ウィンドウ、クリップボードを含む、背後のウィンドウシステムに対する低レベルのアクセスが必要な場合は GDK を使用するべきです。これらの処理に GDK を使用することにより可搬性のあるコードを記述できるとともに、GTK+ で記述されたコードと統合することが可能になります。GDK で提供されるシンプルな描画ルーチンを使用することは通常ありません。かわりに Cairo で提供される、拡張された機能が使用されます。

source: For more information on GDK, see the <ulink url="http://library.gnome.org/devel/gdk/stable/">GDK Reference Manual</ulink>.
ja: GDK についての詳細な情報は <ulink url="http://library.gnome.org/devel/gdk/stable/">GDK Reference Manual</ulink> を参照してください。

source: Cairo is a 2D graphics library featuring a sophisticated API for drawing vector graphics, compositing images, and rendering anti-aliased text. Cairo provides support for multiple output devices, including the X Window System, Microsoft Windows, and image buffers, allowing you to write platform-independent code to draw graphics on different media.
de: Cairo ist eine 2D-Grafikbibliothek, die eine hochentwickelte Schnittstelle für das Zeichnen von Vektorgrafiken, das Erstellen von Bildern und zum Rendern von geglättetem Text bereitstellt. Cairo unterstützt zahlreiche Ausgabegeräte, wie das X-Window-System, Microsoft Windows und Bildpuffer. Dies ermöglicht Ihnen das Schreiben von plattformunabhängigem Code zum Zeichnen von Grafiken auf verschiedenen Medien.
ja: Cairo はベクタグラフィクスやパノラマ画像の描画、およびアンチエイリアスによるテキストのレンダリングといった機能のための、洗練された API を特色とする 2D グラフィクス・ライブラリです。Cairo は X Window System、Microsoft Windows、イメージ・バッファを含めた複数の出力デバイスへのサポートを提供し、異なるメディアにグラフィクスを描画するコードを、プラットフォームに依存せずに記述することを可能にします。

source: The Cairo drawing model is similar to those provided by PostScript and PDF. The Cairo API provides such drawing operations as stroking and filling cubic Bézier splines, compositing images, and performing affine transformations. These vector operations allow for rich, anti-aliased graphics without using expensive pixel-based drawing in your application code.
de: Das Cairo-Darstellungsmodell ist dem von PostScript oder PDF ähnlich. Die Cairo-Schnittstelle bietet solche Zeichenoperationen wie Pinselstriche, Füllen von kubischen Bézier-Objekten, Zusammensetzen von Bildern und die Ausführung von Umwandlungen. Diese Vektor-Operationen ermöglichen hervorragende, geglättete Grafiken ohne Zuhilfenahme pixelbasierten Zeichnens in Ihrem Code.
ja: Cairo は PostScript や PDF と似た描画モデルを提供します。Cairo の API は3次元のベジエ曲線の線描と塗りつぶし、パノラマ画像、およびアフィン変換処理といった描画のための操作を提供します。あなたのアプリケーションのコードでこれらのベクタ操作を使用することにより、高価な処理であるピクセル・ベースの描画を使用することなく、アンチエイリアスされた画像を使用することができます。

source: Cairo's rich drawing model allows for high-quality rendering to multiple media. The same API can be used to create stunning on-screen graphics and text, to render images, or create crisp output suitable for printing.
de: Das Zeichenmodell von Cairo ermöglicht qualitativ hochwertige Ausgaben auf verschiedenen Medien. Die gleiche Schnittstelle wird zur Erzeugung fantastischer Bildschirmgrafiken ebenso verwendet wie für das Darstellen von Bildern oder für knackige Ausdrucke.
ja: Cairo の豊富な描画モデルは複数メディアへの高品質なレンダリングを可能にします。同じ API を使用して、スクリーンに魅力的なグラフィクスやテキストの描画、イメージのレンダリングができ、印刷に適した明瞭な出力を作成することもできます。

source: You should use Cairo whenever you need to draw graphics in your application beyond the widgets provided by GTK+. Much of the drawing inside GTK+ is done using Cairo. Using Cairo for your custom drawing will allow your application to have high-quality, anti-aliased, and resolution-independent graphics.
de: Sie sollten Cairo immer dann verwenden, wenn Sie in Ihren Anwendungen Grafiken zeichnen wollen, die die Widgets von GTK+ nicht bieten. Die meisten Zeichenvorgänge in GTK+ werden bereits mit Cairo ausgeführt. Die Verwendung von Cairo für Ihre spezielle Zeichnung erlaubt qualitativ hochwertige, geglättete und von der Auflösung unabhängige Grafiken in Ihrer Anwendung.
ja: アプリケーションで GTK+ により提供されるウィジェットへの描画という範囲を越えるグラフィクス描画が必要な場合は常に Cairo を使用するべきです。GTK+ 内部の描画にはCairo が多く使用されています。カスタムな描画に Cairo を使用することにより、アプリケーションは高品質でアンチエイリアスされた、解像度に依存しないグラフィクスを手にすることができます。

source: For more information on Cairo, see <ulink url="http://www.cairographics.org/manual/">Cairo: A Vector Graphics Library</ulink>.
ja: Cairo についての詳細は <ulink url="http://www.cairographics.org/manual/">Cairo: A Vector Graphics Library</ulink> を参照してください。

source: Virtual File System
ja: 仮想ファイルシステム

source: GIO, a part of GLib, is the core library used for file and folder operations in GNOME applications. GIO provides a unified file system abstraction layer with pluggable backends. In GNOME, the GVFS library provides a GIO backend implementing multiple network and local protocols. Using GIO with GVFS allows your application to work with files on remote machines as easily as local files.
ja: GLib の一部である GIO は GNOME アプリケーションでのファイル、およびフォルダに対する操作のための中核となるライブラリです。GIO は取り換え可能なバックエンドにたいする、統一された仮想的ファイルシステムというレイヤーを提供します。GNOME では、GIO のバックエンドとして、複数のネットワークプロトコル、およびローカルプロトコルを実装する GVFS ライブラリが提供されます。アプリケーションで GIO を GVFS とともに使用することによりローカルにファイルと同じくらい容易に、リモートマシン上にあるファイルにたいして処理を行うことができます。
