Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: DNS Service Discovery is already used in numerous places throughout GNOME, and further support will be added in the future. For example, <application>Nautilus</application>, the GNOME file manager, uses DNS Service Discovery to locate various file servers on the local network. <application>Ekiga</application>, the videoconferencing and telephony application in GNOME, can locate and publish the user's presence and locate other users on a local network using DNS Service Discovery.
ja: DNS サービス・ディスカバリは GNOME でもいくつかの場所で既に使用されており、今後もさらなるサポートが追加される予定です。たとえば GNOME のファイルマネージャである <application>Nautilus</application> はローカルネットワーク上のさまざまな種類のファイルサーバを発見するのに DNS サービス・ディスカバリを使用しています。GNOME のビデオ会議・テレフォン用のアプリケーションである <application>Ekiga</application> はローカルネットワークで DNS サービス・ディスカバリを使用して、他のユーザを発見したりユーザの位置を公表したりすることができます。

source: Full DNS Service Discovery support is provided by the Avahi library. For more information on Avahi, visit <ulink url="http://avahi.org/">the Avahi web site</ulink>.
ja: 完全な DNS サービス・ディスカバリは Avahi ライブラリによりサポートされています。Avahi についての詳細は <ulink url="http://avahi.org/">Avahi のウェブサイト</ulink> を参照してください。

source: XML and Web Services
ja: XML と Web サービス

source: In our increasingly inter-connected world, more and more applications need to provide support for various web services. Sometimes web services simply provide added functionality, while other times they are the core purpose of the application. Even applications that have been providing a standalone user experience for years have found innovative new uses for web services.
ja: 相互接続が進む私たちの世界においては、さらにより多くのアプリケーションが色々な Web サービスを提供していく必要があります。Web サービスが単に機能の追加を提供する場合もあるし、Web サービスがアプリケーションの主要な目的である場合もあります。スタンドアローンでユーザを何年も満足させていたアプリケーションを Web サービス化することにより、革新的なユーザを新たに獲得した例もあります。

source: The GNOME Platform provides support for using web services from within your application, as well as comprehensive libraries for consuming, managing, and transforming XML, the language of the web.
ja: GNOME プラットフォームはアプリケーションで Web サービスを使用するためのサポートと、ウェブ上の言語である XML の使用、管理、変換のための理解しやすいライブラリを提供します。

source: With the libsoup library, GNOME provides support for the SOAP, a widely-used protocol for passing XML messages over HTTP. SOAP allows developers to expose an interface over the web, which can then be used by applications to retrieve information, send data, make transactions, or use any number of other services provided.
ja: GNOME は libsoup ライブラリによって HTTP 上で XML メッセージをやりとりするために広く用いられている SOAP にたいするサポートを提供します。SOAP は開発者がウェブ上で、アプリケーションが情報を取得するのに使用されたり、データ送信、トランザクションの生成、その他いくつものサービスを提供するためのインタフェースを公開することを可能にします。

source: SOAP can be used to search and retrieve information, to interact with an online store, to manage users' accounts on other systems, or for many other purposes. Web services are being used more and more to provide essential functionality for users, and applications using SOAP can provide a more integrated and featureful user experience.
ja: SOAP は検索や情報の取得のために使用でき、オンラインストアでのやりとりや他のシステムでのユーザ管理、その他さまざまな目的のために使用されます。Web サービスはユーザのために重要な機能を提供するために今後ますます使用が期待できます。また、SOAP を使用するアプリケーションは、より統一され進化したユーザ経験を提供することができます。

source: The libsoup library contains an HTTP implementation and a set of API for constructing and consuming SOAP messages. It also allows for secure authentication, so you can use web services to access private accounts over a secure connection. Using libsoup makes it easy to use web services without manually parsing and interpreting the messages sent through SOAP.
ja: ライブラリには HTTP 実装と SOAP メッセージを構築・使用するための API が含まれています。これにより安全な認証も可能になるため、Web サービスを使用して安全な接続を使用してプライベートなアカウントにアクセスすることができます。

source: For more information on libsoup, see the <ulink url="http://library.gnome.org/devel/libsoup/stable/">libsoup Reference Manual</ulink>.
ja: libsoup についての詳細は <ulink url="http://library.gnome.org/devel/libsoup/stable/">libsoup Reference Manual</ulink> を参照してください。

source: XML Processing
ja: XML 処理

source: Since its formal introduction in 1998, XML (eXtensible Markup Langauge) has been used in increasingly more applications. It is used for a wide variety of purposes, from document formats like XHMTL and DocBook to internet protocols like SOAP and Jabber. XML provides a clean and simple base syntax, allowing applications to focus on their particular needs.
ja: 1998年に正式に紹介されて以来、XML (eXtensible Markup Langauge) を使用するアプリケーションは増加しつづけています。それは XHTML や DocBook のようなドキュメントの書式から、SOAP や Jabber のようなインターネット・プロトコルまで、さまざまな目的で広く使用されてきました。XML は読みやすくてシンプルな基本文法を提供し、アプリケーションがアプリケーション固有の問題に専念することを可能にします。

source: GNOME ships with the libxml2 library, and uses it extensively throughout the desktop. The libxml2 library is a fast and fully standards-compliant XML processing library, providing everything you need to use XML in your application.
ja: GNOME には libxml2 ライブラリが付属しており、デスクトップを通じて広い範囲で使用できます。libxml2 ライブラリは高速で、XML 処理の標準に完全準拠したライブラリであり、アプリケーションで XML を使用するときに必要となるすべてを提供します。

source: The libxml2 library provides a number of different APIs for working with XML, so you can use whatever best suits your application development needs. In addition to a native tree API, libxml2 also provides the callback-based SAX2 API, streaming XML reader and writer interfaces, and complete support for XPath.
ja: libxml2 ライブラリは XML を処理するための、いくつかの異なる API を提供するので、あなたはアプリケーション開発の要件に最適な API を使用することができます。ネイティブのツリー API に加えて、libxml2 はコールバック・ベースの SAX2 API、ストリームからの XML の読み込み・書き込みのためのインタフェース、そして XPath の完全なサポートを提供します。

source: In addition to DTD support, libxml2 also provides full support for validing documents using RELAX NG, which allows a more flexible validation model while remaining simple to use. There is also partial support for XML Schema, the new schema language produced by W3C.
ja: libxml2 は DTD サポートに加えて、より柔軟な妥当性評価モデルを持ち、簡単に使用することができる RELAX NG を使用したドキュメントにたいするサポートを提供します。また W3C が策定した新しいスキーマ言語である XML スキーマも部分的にサポートします。

source: You should use libxml2 whenever you need to work directly with XML in your application. Using libxml2 ensures that you have fully standards-compliant parsing, processing, and XML output. This means developers can stop worrying about incompatibilities between applications.
ja: アプリケーションで直接 XML を処理する場合は libxml2 を使用するべきです。libxml2 を使用することにより、XML の構文解析・処理・出力で完全な標準準拠を保証することができます。これは開発者がアプリケーション間での非互換を心配する必要がないことを意味します。

source: For more information on libxml2, see <ulink url="http://xmlsoft.org/tutorial/index.html">The Libxml Tutorial</ulink> and <ulink url="http://xmlsoft.org/html/libxml-lib.html">The Reference Manual for libxml2</ulink>.
ja: libxml2についての詳細は <ulink url="http://xmlsoft.org/tutorial/index.html">The Libxml Tutorial</ulink> と <ulink url="http://xmlsoft.org/html/libxml-lib.html">The Reference Manual for libxml2</ulink> を参照してください。

source: Transforming XML with XSLT
ja: XSLT による XML の変換

source: XSLT is an XML-based language for transforming XML into other formats. XSLT is a template-based language, allowing you to match particular types of XML elements and create output accordingly. Based on XML and XPath, XSLT enables developers to create clean and modularized templates to convert an XML dialect into another format more suitable for the application.
ja: XSLT は XML を他の書式に変換する XML ベースの言語です。XSLT はテンプレートベースの言語であり、特定のタイプに一致する XML 要素を見つけて適切な出力を生成することができます。XML と XPath を基本として、XSLT は開発者がアプリケーションにより適した他の書式に XML を変換するための読みやすくてモジュール化されたテンプレートを作成することを可能にします。

source: GNOME ships with the libxslt library, a complete implementation of XSLT. The libxslt library is built on top of the XML and XPath support in libxml2, allowing it to be fast and fully standards-compliant.
ja: GNOME には XSLT の完全な実装である libxslt ライブラリが含まれています。libxslt ライブラリは libxml2 の XML、および XPath のサポートを基に構築されていることから、高速で、標準に準拠しています。

source: You should use libxslt if you need to transform XML documents. Although XSLT is not always the right solution for XML processing, it can often simplify development. Since libxslt allows you to add extension elements and extension functions, you can customize it to fit your application.
ja: XML ドキュメントを変換する場合は libxslt を使用するべきです。XML の処理において常に XSLT が正しい解決とは言えないものの、開発が簡単になる場合もあります。libxslt で拡張要素や拡張機能を追加できるようになってからは、アプリケーションに適するようにカスタマイズすることが可能になりました。

source: For more information on libxslt, see <ulink url="http://xmlsoft.org/XSLT/html/index.html">The XSLT C library for Gnome</ulink>.
ja: libxslt についての詳細は <ulink url="http://xmlsoft.org/XSLT/html/index.html">The XSLT C library for Gnome</ulink> を参照してください。

source: Introduction
ja: イントロダクション

source: GNOME is a powerful but simple desktop environment with a strong focus on usability, accessibility, and internationalization. GNOME is designed to be usable by everybody, regardless of technical expertise, disabilitites, or native language. GNOME makes it easy for people to use their computers.
de: GNOME ist eine mächtige und doch schlichte Arbeitsumgebung, bei der das Hauptaugenmerk auf Benutzerfreundlichkeit, Barrierefreiheit und Internationalisierung liegt. GNOME wurde entworfen, um von jedermann benutzt werden zu können, ungeachtet seiner technischen Fähigkeiten, seiner Behinderungen oder seiner Muttersprache. GNOME macht die Benutzung eines Rechners leicht.
ja: GNOME はパワフルで、ユーザビリティとアクセシビリティ、そしてインターナショナライゼーションに焦点を置いたシンプルなデスクトップ環境です。GNOME は誰にでも使えるようにデザインされており、技術的な経験やハンディキャップ、ユーザのネイティブ言語に左右されません。GNOME は人々が簡単にコンピュータを使用できるようにします。

source: GNOME provides a comprehensive developer platform that allow developers to create professional software that is easy to use and aesthetically pleasing. This document provides a high-level overview of the GNOME platform along with links to detailed documentation on each part of the platform.
ja: GNOME は、使いやすくて心をとらえるプロのソフトウェアを作成することを可能にする、理解しやすい開発プラットフォームを提供します。このドキュメントは GNOME プラットフォームの高レベルな概観と、プラットフォームの各部分についての詳細ドキュメントへのリンクを提供します。

source: Who Should Read This Document
ja: 誰がこのドキュメントを読むべきか

source: You should read this document if you want to create software using the GNOME platform. Developing with the GNOME platform will help you create consistent applications that integrate well into the user's desktop. This guide will introduce you to the various components of the platform, so you know which libraries can accomplish which tasks. This guide links to additional detailed documentation, so you can explore each component of the platform in more depth.
ja: もしあなたが GNOME プラットフォームで使用するソフトウェアを作りたいと望むなら、このドキュメントを読むべきです。GNOME プラットフォームで開発することは、あなたがユーザのデスクトップに統合された首尾一貫したアプリケーションを作る助けとなります。このガイドではプラットフォームのさまざまなコンポーネントを紹介しているので、どのライブラリを使えばタスクを達成できるかを知ることができます。このガイドは追加の詳細ドキュメントへとリンクしているので、プラットフォームのそれぞれのコンポーネントについて掘り下げて調べることができます。

source: This guide will also be useful if you are picking a development platform for your software project. It will provide an overview how you can use the GNOME platform to build useful software.
ja: このガイドはソフトウェア・プロジェクトの開発プラットフォームを選択中の人にとっても有用です。ガイドでは GNOME プラットフォームで使いやすいソフトウェアを作る方法についての概要を提供しています。

source: This guide also describes ways of extending the GNOME desktop with plugins, panel applets, and other useful tools. If you want to develop additional functionality to plug into the GNOME desktop, you should read this guide, particularly <xref linkend="desktop-tech"/>.
ja: このガイドは、プラグインにより GNOME デスクトップを拡張する方法や、その他の有用なツールを説明しています。もしあなたが GNOME デスクトップに機能を追加したい場合は、このガイド、特に <xref linkend="desktop-tech"/> を読んでください。

source: If you have existing software that you want to port to the GNOME platform, you should see the online <ulink url="http://live.gnome.org/GuideForISVs">Guide For ISVs</ulink> in addition to this guide.
ja: もしあなたが既にソフトウェアを開発していて、それを GNOME プラットフォームに移植したい場合は、このガイドに加えて <ulink url="http://live.gnome.org/GuideForISVs">Guide For ISVs</ulink> を読むべきでしょう。

source: The GNOME Family
ja: GNOME ファミリー

source: GNOME is a global effort, with many contributors all over the world. GNOME is a success because of its contributors and users. This section lists the web sites and conferences where you can learn more about GNOME, as well as other organizations that work with GNOME.
ja: GNOME は世界中の大勢の貢献者によるグローバルな取り組みです。GNOME は、GNOME の貢献者とユーザによって成功しました。このセクションでは GNOME について更に知るための Web サイトやカンファレンスと、GNOME とともに作業している他の団体について一覧します。

source: Web Sites
ja: Web サイト

source: The primary web site for GNOME users. It contains release information, downloads, and documentation.
ja: GNOME ユーザのための主要サイトです。リリース情報やダウンロード、それにドキュメントが含まれます。

source: The complete source for all GNOME documentation. It contains all of the user and developer documentation produced by GNOME, automatically built and updated for each release.
ja: すべての GNOME ドキュメントの完全な情報源です。ここには GNOME によって製作されたユーザ用、開発者用のすべてのドキュメントが含まれていて、リリースにしたがって自動的に構築・更新されます。

source: The web site for the GNOME Foundation, the not-for-profit foundation that oversees the development of GNOME.
ja: GNOME ファウンデーションの Web サイトです。GNOME ファウンデーションは GNOME の開発を監督する非営利的なファウンデーションです。

source: The GNOME bug trackers. Use this site to submit a bug report or feature request, or to track the status of a report.
ja: GNOME のバグ追跡サイトです。バグ報告や要望の投稿と、それらの報告にたいする対応のステータスを追跡します。

source: The GNOME wiki. Many projects within GNOME now use the wiki as their primary web space. In additional, the wiki is often used to sketch out future development.
ja: GNOME の Wiki サイトです。現在では GNOME の多くのプロジェクトが、この Wiki サイトプロジェクトの主要な Web スペースとして使用しています。さらにこの Wiki サイトは将来の開発についての概要を掲示するために使用されることもあります。

source: The old website for developer information. This once contained developer documentation and information about the usability, documentation, and translation teams. The content on this site has since been largely superseded by <ulink url="http://library.gnome.org/">library.gnome.org</ulink> and <ulink url="http://live.gnome.org/">live.gnome.org</ulink>. There may still be some information on this site that is not found elsewhere.
ja: 開発者のための情報を紹介する古い Web サイトです。かつては開発者用のドキュメントやユーザビリティのドキュメントや翻訳チームについての情報が含まれていました。このサイトに含まれる情報は内容が大きくなってきたことにより <ulink url="http://library.gnome.org/">library.gnome.org</ulink> と <ulink url="http://live.gnome.org/">live.gnome.org</ulink> に移行されました。このサイトにはここでしか参照できない情報がまだいくつか含まれています。

source: Information on GNOME mailing lists. This site contains full archives of all GNOME mailing lists.
ja: GNOME メーリングリストについての情報です。このサイトにはすべての GNOME メーリングリストのアーカイブが含まれています。

source: The GNOME Git repository, tracking all GNOME source code back to the inception of the project.
ja: GNOME の Git リポジトリです。プロジェクト開始当初からの、GNOME のすべてのソースコードを追跡できます。

source: Mailing Lists
ja: メーリングリスト

source: The primary mailing list for GNOME users.
ja: GNOME ユーザのための主要なメーリングリストです。

source: Information and questions about development using the GNOME platform.
ja: GNOME プラットフォームでの開発に関する質問や情報です。

source: The first place to go to get involved with GNOME.
ja: GNOME にかかわるための最初の場所です。

source: Information on accessibility in GNOME applications.
ja: GNOME アプリケーションのアクセシビリティについての情報です。

source: Information on writing documentation for GNOME applications.
ja: GNOME アプリケーションのドキュメント作成のための情報です。

source: Information about internationalization and localization of GNOME applications.
ja: GNOME アプリケーションのインターナショナライゼーションとローカライゼーションについての情報です。

source: usability
ja: ユーザビリティ

source: Information on usability for GNOME applications.
ja: GNOME アプリケーションのユーザビリティについての情報です。

source: Conferences
ja: カンファレンス

source: The primary conference for GNOME users and developers. GUADEC is hosted annually in May or June. Each year, it is hosted in a different European city, making it an excellent excuse to see more of Europe. GUADEC features talks aimed at users, developers, and vendors.
ja: GNOME ユーザと開発者のための主要なカンファレンスです。GUADEC は毎年5月か6月に開催されます。ヨーロッパの色々な場所を見れるという上手い口実もあって、毎年ヨーロッパの異なる都市で開催されています。GUADEC はユーザ、開発者、ベンダを対象にした講演が行われます。

source: The GNOME Summit
ja: GNOME サミット

source: The hacker get-together. The Summit is geared primarily at existing GNOME developers, although there is often useful information for new developers. The Summit is hosted annually in Boston.
ja: ハッカーの集まりです。サミットは主に既存の GNOME 開発者に適していますが、しばしば新しい開発者に有用な情報もあります。サミットは毎年ボストンで開催されています。

source: A casual get-together hosted annually at linux.conf.au.
ja: linux.conf.au では毎年カジュアルな集まりが開催されます。

source: Other Organizations
ja: その他の団体

source: The collaborative effort for interoperability and shared technology among desktop environments. Through freedesktop.org, GNOME works with projects such as KDE and XFCE to make it easier for application developers to provide better experiences for their users.
ja: 共同してデスクトップ環境の相互運用と技術共有について努力しています。GNOME はfreedesktop.org を通じて KDE や XFCE のようなプロジェクトと共に、よりよいユーザ経験を提供するための作業をしています。

source: The free web engine, and a whole lot more. GNOME maintains close ties to the Mozilla development team to provide an overall better user interface.
ja: フリーの Web エンジンであり、それ以上のものも含んでいます。GNOME はよりよいユーザインタフェースを提供するために Mozzila の開発チームと密接な関係を維持しています。

source: The free office suite. GNOME works with the OpenOffice.org development team to help provide a more unified interface when using the free office suite on GNOME.
ja: フリーのオフィス・スイートです。 GNOME は GNOME 上でフリーのオフィス・スイートを使用するときに統一されたインタフェースを提供するために OpenOffice.org の開発チームと作業しています。

source: Freedom. Established in 1985, the Free Software Foundation has worked to create a complete free operating systems, giving its users the freedom to use, modify, and redistribute their software. As part of the GNU project, GNOME aims to provide a fully free desktop environment.
ja: それは"自由"です。 フリーソフトウェア財団はユーザがソフトウェアを自由に使用・変更・再配布・変更できる、完全に無料のオペレーティングシステムを作成するために1985年に設立されました。GNU プロジェクトの一環として、GNOME は完全に自由なデスクトップ環境を提供します。

source: Application and File Type Registries
ja: アプリケーションとファイルタイプのレジストリ

source: In order for applications to be useful, users need to be able to find and run them. Users of the GNOME desktop may run applications using the applications menu, or they may run them by accessing files in the file manager. The GNOME desktop allows you to add applications and file types when you install your application. The mechanism for these is specified on <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so the same data will allow your application to function in other desktop environments.
ja: アプリケーションを使いやすくするために、ユーザがアプリケーションを検索し、それらを実行できるようにする必要があります。GNOME デスクトップのユーザはアプリケーションメニューからアプリケーションを探してアプリケーションを実行するか、ファイルマネージャからファイルを探してアプリケーションを実行します。GNOME デスクトップではアプリケーションをインストールするときにアプリケーションをメニューに追加したりファイルタイプを追加することができます。これらのメカニズムは <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> で策定されているので、同じデータにより他のデスクトップ環境でもアプリケーションは機能します。

source: Adding your application is as simple as providing a desktop entry file with the necessary information. Desktop entry files use a simple key-value syntax, with extra provisions for providing translated content of particular values. Your application's desktop entry file will contain the following information:
ja: アプリケーションをメニューに追加するには単にデスクトップのエントリファイルに必要な情報を提供するだけです。デスクトップのエントリファイルはシンプルな key-value 構文を使用し、値それぞれに翻訳されたテキストをオプションで提供することもできます。デスクトップのエントリファイルには以下の情報が含まれます:

source: A name and a comment, each translated into as many languages as your application supports,
ja: 名前とコメント。アプリケーションがサポートしている場合は多くの言語に翻訳されたテキストが設定されます

source: A list of categories from a fixed list, which are used to place your application in the applications menu,
ja: 固定リストから選ばれたカテゴリのリスト。アプリケーションをアプリケーションメニューのに配置するために使用します

source: An icon, either as a full file path or as a simple name for the icon theme system,
ja: アイコン。アイコンファイルのフルパスか、単にシステムのアイコンテーマのアイコン名を指定します

source: A list of file types that your application supports, and
ja: アプリケーションがサポートするファイルタイプのリスト

source: The command to run your application.
ja: アプリケーションを実行するコマンド

source: If your application handles custom file types that are not already known by the system, you will need to add those types to the file type registry. All file types are accessed with MIME types. For example, Ogg Vorbis audio files have the MIME type <literal>application/ogg</literal>. To add a MIME type, you need to provide a description of the type using a MIME information XML file. These files provide a translated name for the type as well as information on how to determine which files are of the type, either by matching the file name or by inspecting the contents of the file.
ja: プリケーションがシステムでまだ知られていない独自のファイルタイプを処理する場合は、ファイルタイプのレジストリにこれらの型を追加する必要があります。すべてのファイルタイプは MIME 型 によりアクセスされます。たとえば、Ogg Vorbis オーディオ・ファイルは <literal>application/ogg</literal> という MIME 型を持っています。 MIME 型を追加するには、ファイルタイプの説明を MIME 情報についてのXML ファイルを使用して提供する必要があります。これらのファイルにはファイルタイプ名の翻訳や、どのようなファイル名が一致するか、ファイルの内容を検査して決定するのか等、どのような方法でファイルタイプを決定するかについての情報を提供します。

source: For more information on applications, see <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/">The Desktop Entry Specification</ulink> and <ulink url="http://standards.freedesktop.org/menu-spec/latest/">The Desktop Menu Specification</ulink>. For more information on file types, see <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">The Shared MIME Info Specification</ulink>.
ja: アプリケーションについての詳細は <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/">The Desktop Entry Specification</ulink> と <ulink url="http://standards.freedesktop.org/menu-spec/latest/">The Desktop Menu Specification</ulink> を参照してください。ファイルタイプについての詳細は <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">The Shared MIME Info Specification</ulink> を参照してください。

source: Panel Applets
ja: パネルアプレット

source: The GNOME desktop features flexible and powerful panels to which users can add any number of small applications, called panel applets. Panel applets can provide all sorts of quick access to all sorts of useful information and functionality. For instance, the GNOME desktop ships with panel applets to switch between windows and workspaces, display the current weather conditions, and display network activity, among many others.
ja: GNOME デスクトップは柔軟で強力なパネルを提供しています。パネルにはアプレットと呼ばれる小さなアプリケーションをユーザが追加することができます。パネルアプレットは迅速なアクセスと有用な情報と機能を提供します。たとえば GNOME デスクトップに付属しているパネルアプレットでは、ウィンドウやワークスペースを移動できたり、現在の気象情報を表示したり、ネットワークの状況を表示したり、さまざまな機能を提供しています。

source: You may provide a panel applet to augment the functionality of your application, or you may provide a simple stand-alone panel applet. If you simply need to display quick notifications, you should consider using the notification area instead, which is also displayed in the user's panel. Panel applets should be used when you need to provide more functionality than that provided by notification icons.
ja: アプリケーションの機能を強化するためにパネルアプレットを提供したり、単純なスタンドアロンのパネルアプレットを提供することもできます。単に迅速に通知を表示する必要がある場合は代わりに、これもユーザーのパネルに表示される通知領域の使用を検討すべきです。パネルアプレットはアイコンによる通知以上の機能を提供する必要がある場合に使用すべきです。

source: Panel applets are independent processes that use Bonobo to communicate with the panel. Bonobo allows applets to integrate with the panel to provide a consistent user experience. For example, the context menu for every panel applet contains standard items to remove, move, and lock the applet. Each panel applet can then add items to the context menu to perform other actions. The <application>Weather Report</application> panel applet, for example, has context menu items to display a detailed report and to update the displayed information.
ja: パネル・アプレットはパネルと通信するために Bonobo を使用する独立したプロセスです。Bonobo によりアプレットはパネルと統合され、一貫したユーザ経験を提供することができます。たとえばすべてのパネル・アプレットのコンテキストメニューにはアプレットを削除・移動。ロックするための項目が標準で含まれています。それぞれのパネル・アプレットはコンテキストメニューにそれ以外のアクションのための他の項目を追加することができます。たとえば <application>お天気 GNOME</application> パネル・アプレットはコンテキストメニューに詳細の表示や表示を更新するための項目をもっています。

source: Note that Bonobo has been deprecated in favor of D-Bus and other technologies.
ja: Bonobo は時代遅れであり D-Bus および他の技術に置き換えられていることに注意してください。

source: For more information on panel applets, see the <ulink url="http://library.gnome.org/devel/panel-applet/stable/">Panel Applet Library</ulink>.
ja: パネル・アプレットについての詳細は <ulink url="http://library.gnome.org/devel/panel-applet/stable/">Panel Applet Library</ulink> を参照してください。

source: Notification Area
ja: 通知領域(Notification Area)
