Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: VTE is a terminal emulator widget for use in GTK+ applications. It provides a consistent API and uses Pango for text drawing, allowing it to display all internationalized text. VTE is used in GNOME's <application>Terminal</application> application.
ja: VTE は GTK+ アプリケーションで使用するための端末エミュレータウィジェットです。VTE は一貫した API と Pango によるテキストの描画を提供し、国際化されたテキストを表示することを可能にします。VTE は GNOME の <application>端末 (Terminal)</application> アプリケーションで使用されています。

source: Overview of the GNOME Platform
de: Überblick über die GNOME-Plattform
ja: GNOME プラットフォームの概要

source: Overview of the powerful technologies inside the GNOME platform.
de: Überblick über die mächtigen Technologien der GNOME-Plattform.
ja: GNOME プラットフォーム内部で使用されている強力なテクノロジの概要です。

source: translator-credits
de: Mario Blättermann <mariobl@freenet.de>, 2009, 2010, 2011 Christian Kirbach <Christian.Kirbach@googlemail.com>, 2011.
ja: Hiroyuki Sekihara <hiroyuki.sekihara@gmail.com>, 2010 松澤 二郎 <matsuzawa.jr@gmail.com>, 2010 草野 貴之 <AE5T-KSN@asahi-net.or.jp>, 2010

source: The power of HTML5 and the web in your application
de: Die Kraft von HTML5 und des Internet in Ihrer Anwendung

source: WebKit is a powerful, multi-platform HTML engine used in open source and commercial products. WebKitGTK+ is the port of WebKit built on <link xref="gtk">GTK+</link> and integrated into the GNOME developer platform. WebKitGTK+ is developed upstream as part of the main WebKit project, so it's always up to date with the latest HTML5 features.
de: WebKit ist eine mächtige, Plattform übergreifende HTML-Engine, die sowohl in quelloffenen als auch in kommerziellen Produkten eingesetzt wird. WebKitGTK+ ist der auf <link xref="gtk">GTK+</link> aufsetzende Port von WebKit und ist in die GNOME-Entwicklerplattform integriert. WebKitGTK+ wird von dessen Organisation als Teil des WebKit-Hauptprojekts entwickelt und ist somit immer in Bezug auf die aktuellen Funktionsmerkmale von HTML5 auf dem neuesten Stand.

source: WebKitGTK+ makes it easy to add web functionality to your application, or to use HTML5 and associated technologies to create dynamic user interfaces quickly.
de: WebKitGTK+ erleichtert das Hinzufügen von Web-Funktionalität zu Ihrer Anwendung erheblich, oder die Nutzung von HTML5 und den dazugehörigen Technologien zum schnellen Erstellen dynamischer Benutzeroberflächen.

source: WebKitGTK+ demo tuturoail
de: WebKitGTK+ Demo-Tutorial

source: WebKitGTK+ Reference Manual
de: WebKitGTK+-Referenzhandbuch

source: The WebKitGTK+ web site
de: Die WebKitGTK+-Webseite

source: Unified and integrated contacts and instant messaging
de: Vereinheitlichte und integrierte Kontakte und Sofortnachrichten

source: Telepathy provides a powerful framework for interacting with the user's instant messaging contacts. With Telepathy, all accounts and connections are handled by a D-Bus session service that's deeply integrated into the GNOME desktop. Applications can tie into this service to communicate with contacts.
de: Telepathy bietet eine mächtige Umgebung für die Interaktion mit den Sofortnachrichten-Kontakten des Benutzers. Mit Telepathy werden alle Konten und Verbindungen über einen D-Bus-Sitzungsdienst verarbeitet, der tief in der GNOME-Arbeitsumgebung verankert ist. Anwendungen können diesen Dienst nutzen, um mit den Kontakten zu kommunizieren.

source: With the Telepathy Tubes API, you can even tunnel an arbitrary protocal over modern instant messaging protocols like Jabber to create interactive applications. Create multi-player games or collaborative editors that integrate with the desktop-wide instant messaging services.
de: Mit der Tubes-API von Telepathy können Sie ein beliebiges Protokoll durch moderne Sofortnachrichten-Protokolle wie beispielsweise Jabber tunneln, um interaktive Anwendungen zu entwerfen. Erstellen Sie für mehrere Teilnehmer geeignete Spiele oder kollaborative Editoren, die sich in die globalen Sofortnachrichtendienste integrieren.

source: Telepathy Developer's Manual
de: Telepathy-Entwicklerhandbuch

source: Fully internationalized text layout and rendering
de: Vollständig internationalisiertes Text-Layout und Darstellung

source: Pango is the core text and font handling library in the GNOME platform. It is responsible for laying out and rendering text, and is used throughout GTK+.
de: Pango ist die Kernbibliothek für den Umgang mit Text und Schriften auf der GNOME-Plattform. Es ist für das Anordnen und Darstellen von Texten zuständig und wird durchgehend in GTK+ verwendet.

source: Pango Reference Manual
de: Pango-Referenzhandbuch

source: Interactive notifications in the messaging tray
de: Interaktive Meldungen im Benachrichtigungsfeld

source: Notify
de: Benachrichtigungen

source: The libnotify library provides a convenient API for presenting notifications to the user. Notifications can be simple message or they can allow the user to respond. Notifications made with libnotify will use the appropriate interface in the environment the application is running in. In GNOME 3, notifications are displayed at the bottom of the screen and then put into the messaging tray.
de: Die libnotify-Bibliothek stellt eine bequeme Schnittstelle bereit, über die dem Benutzer Benachrichtigungen angezeigt werden können. Solche Benachrichtigungen können einfache Meldungen sein, oder auch solche, auf die der Benutzer antworten kann. Mit libnotify erstellt Benachrichtigungen nutzen die entsprechende Schnittstelle der Umgebung, in der die Anwendung ausgeführt wird. In GNOME 3 werden die Benachrichtigungen am unteren Rand des Bildschirms dargestellt und dann in das Benachrichtigungsfeld verschoben.

source: Libnotify Reference Manual
de: Libnotify-Referenzhandbuch

source: Secure storage for passwords and other data
de: Sicheres Speichern von Passwörtern und anderen Daten

source: Keyring
de: Schlüsselbund

source: GNOME provides a modern and secure keyring manager to store users' passwords and other sensitive data. Applications can use the keyring manager library to store and access passwords, and users can manage their passwords using GNOME's <app>Seahorse</app> application.
de: GNOME stellt eine moderne und sichere Schlüsselbundverwaltung zum Speichern von Benutzerpasswörtern und anderen sicherheitsrelevanten Daten bereit. Anwendungen können die Bibliothek der Schlüsselbundverwaltung zum Speichern und Zugreifen auf Passwörter verwenden. Benutzer können ihre Passwörter in der GNOME-Anwendung <app>Schlüsselbundverwaltung</app> verwalten.

source: For API references please see the <link href="http://developer.gnome.org/gnome-keyring/stable/">gnome-keyring Reference Manual</link> and the <link href="http://developer.gnome.org/libseahorse/stable/">libseahorse Reference Manual</link>.
de: Weitere Informationen über API-Referenzen finden Sie im <link href="http://library.gnome.org/gnome-keyring/stable/">gnome-keyring Referenzhandbuch</link> und dem <link href="http://library.gnome.org/libseahorse/stable/">libseahorse Referenzhandbuch</link>.

source: The GNOME platform provides a comprehensive development environment for graphical applications and other software. GNOME provides a comprehensive developer platform that allow developers to create professional software that is easy to use and aesthetically pleasing. Using the technologies in GNOME, you can create high-quality software to meet and exceed your users' expectations. This document provides a high-level overview of the GNOME platform along with links to detailed documentation on each part of the platform.
de: Die GNOME-Plattform bietet eine Entwicklungsumgebung für grafische Anwendungen und andere Software. GNOME stellt eine umfassende Entwicklerplattform bereit, die die Erstellung professioneller Software erlaubt, welche leicht zu bedienen ist und auch ästhetischen Ansprüchen genügt. Unter Verwendung der GNOME-Technologien können Sie qualitativ hochwertige Software erstellen, welche die Erwartungen Ihrer Benutzer erfüllt und sogar übersteigt. Dieses Dokument bietet einen ausführlichen Überblick über die Plattform, begleitet von Links zu detaillierteren Informationen zu jedem der Bestandteile.

source: Graphics and Multimedia
de: Grafik und Multimedia

source: Core Application Support
de: Unterstützung für zentrale Anwendungen

source: Application Technologies
de: Anwendungstechnologien

source: Under the Hood
de: Unter der Haube

source: Topic-oriented help system
de: Themenbasiertes Hilfesystem

source: Help
de: Hilfe

source: Users sometimes need a little help, even with the best-designed applications. GNOME provides a built-in topic-oriented help system using the <link href="http://projectmallard.org/">Mallard</link> markup language. Pioneered by GNOME developers, Mallard is an agile and dynamic language that helps you write and revise quickly. Its topic-oriented design means your users can find the answers they need without sifting through a manual. With its unique linking and organization system, Mallard is the only language designed to handle plugin and vendor help in one coherent document.
de: Benutzer benötigen gelegentlich etwas Hilfe, selbst für die perfektesten Anwendungen. GNOME verfügt über ein eingebautes, themenorientiertes Hilfesystem, welches die Auszeichnungssprache <link href="http://projectmallard.org/">Mallard</link> nutzt. Von den GNOME-Entwicklern ins Leben gerufen, ist Mallard eine agile und dynamische Sprache, die das Schreiben und Überarbeiten erheblich erleichtert. Mit seinem beispiellosen Verweis- und Organisationssystem ist Mallard die einzige Sprache, die mit Plugins und Hinzufügungen von Drittanbietern in einem einzigen zusammenhängenden Dokument umgehen kann.

source: When you do need linear manuals, GNOME also supports the industry-standard <link href="http://docbook.org/">DocBook</link> format.
de: Falls Sie linear aufgebaute Handbücher benötigen, unterstützt GNOME auch das als Industriestandard designierte <link href="http://docbook.org/">DocBook</link>-Format.

source: Ten Minute Mallard Tour
de: Zehn-Minuten-Tour in Mallard

source: The Mallard web site
de: Die Mallard-Webseite

source: The DocBook web site
de: Die DocBook-Webseite

source: Graphical interfaces and core application support
de: Grafische Schnittstellen und Unterstützung für zentrale Anwendungen

source: GTK+ Reference Manual
de: GTK+-Referenzhandbuch

source: The GTK+ web site
de: Die GTK+-Webseite

source: Plugin-based rich multimedia creation and delivery
de: Plugin-basierte, reichhaltige Multimedia-Erzeugung und Wiedergabe

source: For comprehensive information on GStreamer, see <link href="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">The GStreamer Application Development Manual</link>, <link href="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">The GStreamer 0.10 Core Reference Manual</link>, and <link href="http://gstreamer.freedesktop.org/documentation/">the GStreamer documentation page</link>.
de: Umfassende Informationen zu GStreamer finden Sie in <link href="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">The GStreamer Application Development Manual</link>, <link href="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">The GStreamer 0.10 Core Reference Manual</link> und der <link href="http://gstreamer.freedesktop.org/documentation/">Dokumentationsseite zu GStreamer</link>.

source: Asynchronous file and URI handling with access to file and volume info
de: Asynchrone Verarbeitung von Dateien und Adressen mit Zugriff auf Informationen zu Dateien und Datenträgern

source: GIO Files
de: GIO-Dateien

source: GIO provides APIs for asynchronously reading and writing files and other streams. Files are referenced by URIs, and local backends can provide access to more than just local files. When running under the GNOME desktop, GIO uses GVfs to allow access to files over SFTP, FTP, WebDAV, SMB, and other popular protocols. This transparent network file access is free to all applications using GIO.
de: GIO stellt Schnittstellen zum asynchronen Lesen und Schreiben von Dateien und anderen Datenströmen bereit. Dateien werden als Adressen referenziert, so dass lokale Backends auf mehr als nur lokale Dateien zugreifen können. Innerhalb der GNOME-Arbeitsumgebung benutzt GIO GVfs zum Zugriff auf Dateien über SFTP, FTP, WebDAV, SMB und andere populäre Protokolle. Dieser transparente Netzwerkzugriff auf Dateien ist aus allen Anwendungen heraus möglich, die GIO nutzen.

source: The GIO file APIs were designed to be used in event-driven graphical interfaces. The non-blocking, asynchronous design means your user interface doesn't hang while waiting for a file. There are also synchronous versions of the APIs available, which are sometimes more convenient for worker threads or processes.
de: Die Datei-APIs in GIO wurden für die Nutzung in ereignisgesteuerten grafischen Benutzeroberflächen entworfen. Das nicht-blockierende, asynchrone Design bedeutet, dass die Benutzeroberfläche Ihrer Anwendung nicht ausgebremst wird, während auf eine Datei gewartet wird. Es sind auch synchrone Versionen der APIs verfügbar, welche gelegentlich für Arbeitsthreads oder Prozesse notwendig sind.

source: GIO also provides routines for managing drives and volumes, querying file types and icons, and finding applications to open files.
de: GIO bietet außerdem Routinen für die Verwaltung von Laufwerken und Datenträgern, die Abfrage von Dateitypen und Symbolen und zum Suchen von Anwendungen zum Öffnen von Dateien.

source: GIO Reference Manual
de: GIO-Referenzhandbuch

source: Powerful networking API built on the GIO stream classes
de: Mächtige Netzwerk-API, die auf den GIO-Stream-Klassen aufsetzt

source: GIO Networking
de: Netzwerk mit GIO

source: Built on top of the stream APIs used for files, GIO provides high-level networking APIs to communicate over TCP/IP and UNIX domain sockets. You can use the GIO networking APIs to connect to a server, listen for events, and read resources. The asynchronous API designs means your application doesn't block waiting for a response.
de: Aufbauend auf den für Dateien verwendeten Stream-APIs bietet GIO Netzwerk-APIs auf höherer Ebene für die Kommunikation über TCP/IP und UNIX Domain-Sockets. Sie können die Netzwerk-APIs aus GIO für die Verbindung zu einem Server, zum Lauschen nach Ereignissen und Lesen von Ressourcen verwenden. Das asynchrone API-Design hat zur Folge, dass Ihre Anwendung nicht blockiert wird, während auf eine Antwort gewartet wird.

source: Lowlevel network support
de: Netzwerkunterstützung auf niederer Ebene

source: Highlevel network functionality
de: Netzwerkfunktionalität auf höherer Ebene

source: Underlying windowing and event handling
de: Darunterliegendes Handling von Fenstern und Ereignissen

source: GDK is the low-level library used by GTK+ to interact with the system for graphics and input devices. Although you will rarely use GDK directly in application code, it contains all the necessary functionality to draw objects and text to the screen and to interact with the user with various input devices.
de: GDK ist die Low-Level-Bibliothek, die von GTK+ zur Interaktion mit dem System für grafische und Eingabegeräte verwendet wird. Obwohl Sie GDK im Anwendungscode kaum direkt verwenden werden, enthält es doch alle notwendige Funktionalität zum Darstellen von Text und Objekten auf dem Bildschirm sowie zur Interaktion des Benutzers mit den verschiedenen Eingabegeräten.

source: GDK Reference Manual
de: GDK-Referenzhandbuch

source: Common relational database access
de: Zugriff auf verbreitete relationale Datenbanken

source: GDA offers a wrapper around relational databases, allowing you to easily store and retrieve data in many different common database systems.
de: GDA bietet einen Wrapper für relationale Datenbanken, welcher Ihnen das einfache Speichern und Holen von Daten in verschiedenen verbreiteten Datenbanksystemen ermöglicht.

source: Integration with the desktop-wide address book and calendar
de: Integration mit dem globalen Adressbuch und Kalender

source: Evolution API Reference: libebook
de: Evolution-API-Referenz: libebook

source: Evolution API Reference: libecal
de: Evolution-API-Referenz: libecal

source: Standard interprocess communications bus
de: Standard-Bus für die Interprozess-Kommunikation

source: D-Bus is developed jointly on <link href="http://www.freedesktop.org/">freedesktop.org</link>, so you can use it with different desktop environments and applications. Because D-Bus is a cross-desktop project, you use it to create portable and versatile software that seamlessly integrates with the user's desktop, regardless of which desktop it is.
de: D-Bus wird plattformübergreifend auf <link href="http://www.freedesktop.org/">freedesktop.org</link> entwickelt, so dass Sie es in verschiedenen Arbeitsumgebungen und Anwendungen nutzen können. Weil D-Bus ein plattformübergreifendes Projekt ist, eignet es sich zum Entwurf portierbarer und vielseitiger Software, die sich nahtlos in die Arbeitsumgebung einfügt, unabhängig von deren Ursprung.

source: GNOME provides full support for D-Bus using the GBus and GDBus APIs in GIO.
de: GNOME bietet über die APIs von GBus und GDBus in GIO vollständige Unterstützung für D-Bus.

source: D-Bus Specification
de: D-Bus-Spezifikation

source: Stunning graphics and animations with a scene-graph API
de: Überwältigende Grafiken und Animationen mit einer Szenengrafik-API

source: Clutter is a library that allows creating fast, portable, dynamic, compelling user interfaces.
de: Clutter ist eine Bibliothek zum Erstellen schneller, portabler, dynamischer und ansprechender Benutzerschnittstellen.

source: Clutter uses the <link href="http://www.khronos.org/opengl/">OpenGL</link> and <link href="http://www.khronos.org/opengles/">OpenGL|ES</link> industry standard API to access the accelerated graphical hardware on both desktop and mobile environments alike, without exposing the complexities of GPU pipeline programming.
de: Clutter verwendet die Industriestandard-APIs <link href="http://www.khronos.org/opengl/">OpenGL</link> und <link href="http://www.khronos.org/opengles/">OpenGL|ES</link>, um Hardwarebeschleunigung für Grafik sowohl auf Arbeitsplatz- als auch auf mobilen Rechnern einzusetzen, ohne die Komplexität der GPU Pipeline-Programmierung zu enthüllen.

source: Clutter does not specify any visual style, and does not provide any pre-defined complex user interface control; it lets the developer define what is needed, using a flexible scene graph API, with free-form placement of the scene elements (or "actors") on the main viewport (or "stage").
de: Clutter definiert keinen visuellen Stil und bietet keine vorkonfigurierte komplexe Steuerung der Benutzerschnittstelle; es überlässt den Entwicklern die Definition alles notwendigen mit Hilfe einer flexibler API für Szenegraphen mit freier Platzierung der Szenenelemente (d.h. Akteuren) und des Bildschirmausschnitts (d.h.Bühne).

source: A number of third-party libraries allow integration with other technologies, such as: Clutter-GTK, for embedding a Clutter stage inside a GTK+ application; Clutter-GStreamer, for embedding GStreamer video and audio pipelines; Clutter-Box2D and Clutter-Bullet, for adding physics interaction in both 2D and 3D environments.
de: Eine Reihe Bibliotheken von Drittanbietern ermöglicht die Integration mit anderen Technologien wie z.B.: Clutter-GTK für die Einbettung einer Clutter-Ansicht in eine GTK+-Anwendung, Clutter-GStreamer zum Einbetten von GStreamer-Video und Ton, Clutter-Box2D und Clutter-Bullet zum Hinzufügen von physikalischer Interaktion in 2D- als auch 3D-Umgebungen.

source: The Clutter Cookbook
de: Das Clutter-Kochbuch

source: Clutter Reference Manual
de: Clutter-Referenzhandbuch

source: The Clutter web site
de: Die Webseite von Clutter

source: Simple audio API for notifications and events
de: Einfache Audio-Schnittstelle für Benachrichtigungen und Ereignisse

source: Canberra is a simple library for playing audio events and notifications, such as when the user has received a message or an error has occurred. As well as providing a convenient API, Canberra can also work with the accessibility features of the desktop to provide alternate notification for hearing-impaired users.
de: Canberra ist eine einfache Bibliothek zum Abspielen von Klangereignissen und Benachrichtigungen, beispielsweise wenn der Benutzer eine Nachricht erhalten hat oder ein Fehler aufgetreten ist. Neben der Bereitstellung einer komfortablen API kann Canberra außerdem mit den Barrierefreiheits-Funktionsmerkmalen der Arbeitsumgebung umgehen, um alternative Benachrichtigungen für Benutzer mit eingeschränkten Hörvermögen bereitzustellen.

source: Canberra Reference
de: Canberra Referenz

source: Modern 2D vector drawing canvas
de: Moderne Zeichenfläche für zweidimensionale Vektorgrafik

source: Cairo Manual
de: Cairo-Handbuch

source: Support for screen readers and other accessibility tools
de: Unterstützung für Bildschirmleser und andere Barrierefreiheitswerkzeuge

source: GNOME provides support for accessibility devices using the ATK framework. This framework defines a set of interfaces to which graphical interface components adhere. This allows, for instance, screen readers to read the text of an interface and interact with its controls. ATK support is built into GTK+ and the rest of the GNOME platform, so any application using GTK+ will have reasonable accessibility support for free.
de: GNOME bietet über das ATK-Framework Unterstützung für Barrierefreiheits-Geräte. Dieses Framework definiert eine Reihe von Schnittstellen, die sich mit den Komponenten der grafischen Schnittstellen verbinden. Dies erlaubt beispielsweise Bildschirmlesern das Lesen von Text einer Schnittstelle und die Interaktion mit deren Bedienelementen. ATK-Unterstützung ist in GTK+ und die übrige GNOME-Plattform eingebaut, so dass jede GTK+ nutzende Anwendung ansprechende Barrierefreiheits-Unterstützung als Gratisbeigabe erhält.

source: The GNOME desktop ships with a number of accessibility tools which enable users with disabilities to take full advantage of their desktop and applications. Applications that fully implement ATK will be able to work with the accessibility tools. GNOME's accessibility tools include a screen reader, a screen magnifier, an on-screen keyboard, and <app>Dasher</app>, an innovative predictive text entry tool.
de: Die GNOME-Arbeitsumgebung wird mit einer Reihe von Barrierefreiheits-Werkzeugen geliefert, die es Benutzern mit Behinderungen ermöglichen, ihre Arbeitsumgebung und ihre Anwendungen uneingeschränkt zu benutzen. Anwendungen, die ATK vollständig implementieren, sind fähig, mit diesen Barrierefreiheits-Werkzeugen zu arbeiten. Die GNOME-Barrierefreiheits-Werkzeuge enthalten einen Bildschirmleser, eine Bildschirmlupe, eine Bildschirmtastatur sowie <app>Dasher</app>, ein innovatives und vorausschauendes Werkzeug zur Texteingabe.

source: GNOME Accessibility for Developers
de: GNOME-Barrierefreiheit für Entwickler

source: ATK Reference
de: ATK-Referenz
