Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: The libgnomeprint library implements the PostScript imaging model, which is used by most printers. Printers which do not support PostScript can still be supported through CUPS, described below. In addition to the standard PostScript imaging, libgnomeprint also features alpha channel support and anti-aliasing.
ja: libgnomeprint ライブラリは多くのプリンタで使用されている PostScript のイメージングモデルを実装しています。PostScript をサポートしないプリンタについては以降で説明する CUPS を通じてサポートされます。libgnomeprint は標準の PostScript イメージングに加え、アルファ・チャンネルとアンチ・エイリアスをサポートします。

source: The libgnomeprintui library provides a standard print dialog, a print preview dialog, and various other controls and functionality required to build printing into an intuitive user interface. The GNOME print framework handles the details of locating printers and spooling print jobs, and also provides PostScript and PDF export directly in the print dialog.
ja: The libgnomeprintui ライブラリは標準的な印刷ダイアログ、印刷プレビューダイアログ、そしてその他のさまざまなコントロールを提供し、印刷の処理を構築するのに要求される機能を直感的なユーザインタフェースで提供します。GNOME プリントフレームワークはプリンタの位置やスプールされた印刷ジョブの詳細を処理し、印刷ダイアログから PostScript や PDF に直接エクスポートする機能を提供します。

source: You should use libgnomeprint whenever you need to render content to PostScript for printing. You should use libgnomeprintui to construct your printing user interface, even if your rendered output comes from another source. Using the GNOME print framework provides your users a consistent user interface with the features they expect of printing appliations.
ja: 印刷のために PostScript を出力する必要がある時は常に libgnomeprint を使用すべきです。また、ユーザインタフェースを構築する場合はそれがたとえ libgnomeprint 以外のソースによる出力のときでも libgnomeprintui を使用すべきです。GNOME プリントフレームワークはユーザが印刷を行うアプリケーションに期待する統一されたユーザインタフェースを提供します

source: On most GNOME systems, CUPS (Common UNIX Printing System) acts as the low-level printing system. CUPS provides a modern, feature-rich architecture for printer discovery, printer option access, and spooling print jobs to different types of printers.
ja: 大部分の GNOME システムでは、CUPS (Common UNIX Printing System)が低レベルの印刷システムとして機能します。CUPS はプリンタの検索、プリンタのオプションへのアクセス、そして異なるプリンタに対する印刷ジョブのスプーリングなどのモダンで機能豊富なアーキテクチャを提供します。

source: CUPS provides a set of utilities for automatically discovering printers locally and on the network. This allows users not only to see all available printers, but to use different types of printers without manual configuration.
ja: CUPS はローカルおよびネットワーク上にあるプリンタを自動的に検索するユーティリティを提供します。これによりユーザは使用可能なすべてのプリンタを検索できるだけでなく、手動で設定することなく異なる種類のプリンタを使用することができます

source: CUPS provides a unified interface for printing, regardless of the location or type of the printer. Multiple print protocols are handled seamlessly by CUPS by automatically applying filters to content sent to the printers. Applications can simply provide PostScript output, and CUPS will automatically convert it for printers that do not support PostScript natively.
ja: CUPS はプリンタの位置や種類に左右されない、印刷のための統一されたインタフェースを提供します。 複数の印刷プロトコルは CUPS によりシームレスに処理され、自動的にフィルタが適用された後に接続先のプリンタに送信されます。 アプリケーションは単純に PostScript の出力を提供すれば, CUPS が自動的に PostScript をネイティブでサポートしないプリンタに対する出力の変換を行います。

source: CUPS also provides printer configuration options in the form of PostScript Printer Description (PPD) files. PPD configurations allow applications to expose the capabilities of individual printers to the users with a consistent user interface. For instance, PPD allows you to detect whether a printer can collate and staple print jobs, and to provide an option in your user interface.
ja: CUPS は PostScript プリンタ記述 (PostScript Printer Description: PPD) ファイルの形式によるプリンタの設定オプションも提供します。PPD 設定によりアプリケーションは個々のプリンタの能力を引き出し、統一されたユーザインタフェースによる使用することが可能になります。たとえば PPD により印刷ジョブに対して collate (訳注: 複数枚印刷する時の出力順序) や staple (訳注: 印刷物にホチキスを打つ位置) を指定できるプリンタを決定してユーザインタフェースにそのオプションを表示することができます。

source: In most cases, you will not need to interface directly with CUPS in your applications. By using the GNOME print framework, you have access to the power and flexibility of CUPS automatically. Having CUPS underneath means a better user experience with less programming.
ja: ほとんどのケースではアプリケーションから CUPS を直接インタフェースをもつことはないでしょう。GNOME プリントフレームワークを使用することにより、あなたは CUPS の柔軟さとパワーに自動的にアクセスできます。CUPS を下位にもつということは、プログラミングの量を少なくすることのよいユーザ経験です。

source: Language Bindings
ja: 言語バインディング

source: Although the GNOME platform is written primarily in C, it is written intentionally to make it easy to bind to other programming languages. Using language bindings, you can develop with the GNOME platform natively in your programming language of choice.
ja: GNOME プラットフォームは主にC言語で書かれていますが、他のプログラミング言語に簡単にバインドできるように意図して記述されています。言語バインディングを使用することにより、GNOME プラットフォームで好みのプログラミング言語による開発を行うことができます。

source: Language bindings exist for many programming languages, and the GNOME platform officially supports bindings for C++, Java, Perl, and Python.
ja: 言語バインディングには、多くのプログラミング言語、および GNOME プラットフォームで公式にサポートされているの C++ や Java、Perl、および Python 用のバインディングのサポートが存在します。

source: The C++ bindings provide complete coverage of the GNOME platform, including GTK+, Libglade, and GConf. The C++ bindings wrap all objects with native C++ objects and allow programmers to provide custom widgets with normal C++ inheritence. They provide a fully native API, with type-safe signal handlers, full use of the standard C++ library, and complete C++ memory management.
ja: C++ バインディングは GTK+、Libglade、GConf を含む GNOME プラットフォームを完全に網羅します。C++ バインディングはすべてのオブジェクトをネイティブの C++ オブジェクトにラップし、プログラマが独自のウィジェットを通常の C++ インタフェースで提供できるようにします。C++ バインディングは、タイプセーフなシグナルハンドラ、すべての標準 C++ ライブラリの使用、そして完全な C++ メモリ管理をもつネイティブな API を提供します。

source: For more information on the GNOME C++ bindings, visit <ulink url="http://www.gtkmm.org/">the gtkmm web site</ulink>.
ja: GNOME の C++ バインディングについての詳細は <ulink url="http://www.gtkmm.org/">gtkmm の Web サイト</ulink> を参照してください。

source: The Java bindings provide complete coverage of the GNOME platform, including GTK+, Cairo, and GConf. The Java bindings wrap all objects with native Java objects and allow programmers to provide custom widgets with normal Java inheritence. They provide a fully native API, using Java's class libraries and interfaces wherever appropriate.
ja: Java バインディングは GTK+、Cairo、GConf を含む GNOME プラットフォームを完全に網羅します。Java バインディングはすべてのオブジェクトをネイティブの Java オブジェクトにラップし、プログラマが独自のウィジェットを通常の Java の継承により提供できるようにします。Java バインディングは Java のクラスライブラリ、適切なインタフェースを使用して完全にネイティブな API を提供します。

source: For more information on the GNOME Java bindings, visit <ulink url="http://java-gnome.sourceforge.net/">the Java-GNOME web site</ulink>.
ja: GNOME の Java バインディングについての詳細は <ulink url="http://java-gnome.sourceforge.net/">Java-GNOME の Web サイト</ulink> を参照してください。

source: The Perl bindings provide native Perl interfaces for the GNOME platform, including GTK+, GnomeVFS, and GConf. The Perl bindings wrap all objects with Perl objects and allow programmers to use standard Perl practices to manipulate them. They provide a fully native API, using Perl's native data types wherever appropriate.
ja: Perl バインディングは GTK+、GnomeVFS、GConf を含む GNOME プラットフォームのための Perl のネイティブなインタフェースを提供します。Perl バインディングはすべてのオブジェクトを Perl オブジェクトにラップし、プログラマが通常 Perl を使う標準的な方法でそれらを操作することを可能にします。Perl バインディングは Perl のネイティブなデータ型を適切に使用して、完全にネイティブな API を提供します。

source: For more information on the GNOME Perl bindings, visit <ulink url="http://gtk2-perl.sourceforge.net/">the gtk2-perl web site</ulink>.
ja: GNOME の Perl バインディングについての詳細は <ulink url="http://gtk2-perl.sourceforge.net/">gtk2-perl の Web サイト</ulink> を参照してください。

source: The Python bindings provide native Python interfaces for the GNOME platform, including GTK+, GnomeVFS, and GConf. The Python bindings wrap all objects with native Python objects and allow programmers to provide custom widgets with normal Python inheritence. They provide a fully native Python API which automatically handles details like type casting and memory management.
ja: Python バインディングは GTK+、GnomeVFS、GConf を含む GNOME プラットフォームのための Python のネイティブなインタフェースを提供します。Python バインディングはすべてのオブジェクトを Python オブジェクトにラップし、プログラマが独自のウィジェットを通常の Python の継承により提供できるようにします。Python バインディングはタイプキャストやメモリ管理などの詳細を自動的に処理して、完全にネイティブな Python のための API を提供します。

source: For more information on the GNOME Python bindings, visit <ulink url="http://www.pygtk.org/">the PyGTK web site</ulink>.
ja: GNOME の Python バインディングについての詳細は <ulink url="http://www.pygtk.org/">PyGTK の Web サイト</ulink>を参照してください。

source: Other Languages
ja: その他の言語

source: Full or partial bindings exist for many other programming languages, such as C#, Eiffel, JavaScript, Ruby, and Scheme. Even though they may not currently be officially supported by GNOME, many of these bindings are of the same high quality as the official GNOME bindings, and some of them may be included as official GNOME bindings in future releases.
ja: C#、Eiffel、JavaScript、Ruby、Scheme、その他の言語に完全または部分的に対応したバインディングが数多く存在します。それらがまだ正式に GNOME でサポートされていないとしても、それらのバインディングは GNOME で公式にサポートされているバインディングと同程度に高品質であり、それらのいくつかは将来のリリースで GNOME の公式バインディングに含まれることでしょう。

source: For a list of language bindings, visit <ulink url="http://www.gtk.org/language-bindings.html">the GTK+ bindings page</ulink>.
ja: 言語バインディングについての詳細は <ulink url="http://www.gtk.org/language-bindings.html">GTK+ bindings page</ulink> を参照してください。

source: Quick Module Overview
ja: モジュールの早見表

source: This appendix provides a quick overview of the libraries included in the GNOME desktop and developer platform. Libraries are listed by module with a brief description and a link for more information in this document, where possible.
ja: この付録 (<firstterm>Apendix</firstterm>) では GNOME デスクトップと開発者向けプラットフォームを含むライブラリの簡単な概要を提供します。ライブラリはモジュールの簡単な説明と共にモジュールごとにリストされています。また、可能な場合はこのドキュメントの情報にリンクしています。

source: Platform Modules
ja: プラットフォームモジュール

source: Modules in the GNOME developer platform make strict guarantees about API and ABI stability. Applications developed against platform modules can be assured of running unmodified for the duration of the GNOME 2 lifecycle.
ja: GNOME の開発者向けプラットフォームのモジュールは、API と ABI の安定性についての完全に保証します。プラットフォームモジュールにたいして開発されたアプリケーションは、GNOME2のリリース期間中は変更せずに実行できることが保証されます。

source: GConf provides the daemon and libraries for storing and retrieving configuration data. GConf is discussed in <xref linkend="gconf"/>.
ja: GConf は設定データを保存・取得するためのデーモンとライブラリを提供します。 GConf については <xref linkend="gconf"/> で議論しています。

source: ORBit is a deprecated CORBA server. GNOME's deprecated component architecture, Bonobo, is built on top of CORBA. CORBA is discussed in <xref linkend="bonobo-corba"/>.
ja: ORBit は非推奨の CORBA サーバーです。 GNOME が推奨するコンポーネントアーキテクチャである Bonobo は CORBA 上に構築されています。CORBA については、 <xref linkend="bonobo-corba"/> で議論しています。

source: ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications. ATK is discussed in <xref linkend="a11y"/>.
ja: ATK は他のツールキットやアプリケーションで実装されるアクセシビリティのためのインタフェースを提供します。ATK のインタフェースを使用することにより、アクセシビリティツールは実行されているアプリケーションを完全に表示・制御することができます。ATK については <xref linkend="a11y"/> で議論しています。

source: GAIL provides an implementation of the ATK interfaces for GTK+ and GNOME libraries, allowing accessibility tools to interact with applications written using these libraries. In 2009 GAIL was moved into GTK+. Accessibility is discussed in <xref linkend="a11y"/>.
ja: GAIL は GTK+、GNOME ライブラリのために ATK インタフェースの実装を提供し、アクセシビリティツールがそれらのライブラリを使用して記述されたアプリケーションと相互作用することを可能にします。2009年に GAIL は GTK+ に移行されました。アクセシビリティについては <xref linkend="a11y"/> で議論しています。

source: A part of GLib, the GIO library provides a high-level API for accessing files and folders. Together with the GVFS library, it provides a file system abstraction that allows transparent access to local and remote files. GIO is discussed in <xref linkend="gio"/>.
ja: GLib の一部である GIO ライブラリはファイルやフォルダにアクセスするための高レベルな API を提供します。GVFS ライブラリと協調することにより、ローカルとリモートのファイルにたいして透過的にアクセスするための仮想的なファイルシステムを提供します。GIO については <xref linkend="gio"/> で議論しています。

source: GLib provides the core application building blocks for libraries and applications written in C. It provides the core object system used in GNOME, the main loop implementation, and a large set of utility functions for strings and common data structures.
ja: GLib は C で記述されたライブラリやアプリケーションにたいしてアプリケーションを構築するブロックの中核を提供します。GLib は GNOME のシステムで使用されているコアオブジェクト、main ループの実装、文字列や一般的なデータ型のための膨大なユーティリティ関数を提供します。

source: GnomeVFS is a deprecated library for accessing files and folders. It is superseded by GIO and GVFS. Newly written code should use GIO instead.
ja: GnomeVFS はファイルやフォルダにアクセスするための非推奨なライブラリです。GnomeVFS は GIO と GVFS に置き換えられました。新しく記述されるコードでは GIO を使用するべきです。

source: GTK+ is the primary library used to construct user interfaces in GNOME applications. It provides user interface controls and signal callbacks to control user interfaces. GTK+ is discussed in <xref linkend="gtk"/>.
ja: GTK+ は GNOME アプリケーションでユーザインタフェースを構築するのに使用される主要なライブラリです。GTK+ はユーザインタフェースのコントロールとそれを制御するためのシグナルのコールバックを提供します。GTK+ については <xref linkend="gtk"/> で議論しています。

source: GVFS provides a backend implementation for GIO, allowing access to numerous protocols with the GIO API. Developers do not access GVFS directly. Instead, applications written with GIO will automatically use GVFS on systems where it is enabled.
ja: GVFS は GIO のバックエンドを実装します、GIO の API のさまざまなプロトコルによるアクセスを可能にします。開発者は GVFS に直接アクセスせずに GIO を使用してください。GIO により記述されたアプリケーションは自動的にシステムで使用可能な GVFS を使用します。

source: libIDL is a deprecated library for parsing Interface Definition Language (IDL) files, which are necessary for CORBA interfaces. libIDL is used by GNOME's deprecated CORBA implementation, ORBit. CORBA is discussed in <xref linkend="bonobo-corba"/>.
ja: libIDL は CORBA インタフェースで必要となるインタフェース定義言語 (IDL) のファイルを解析するための非推奨なライブラリです。libIDL は GNOME の非推奨な CORBA 実装である ORBit を使用しています。CORBA については <xref linkend="bonobo-corba"/> で議論しています。

source: libart is a deprecated graphics library which can render vector paths. It is used by the GnomeCanvas widget. Newly written code should not use libart_lgpl and instead use Cairo and/or other technologies.
ja: libart はベクトルパスを描画することができる非推奨なライブラリです。libart はGnomeCanvas ウィジェットで使用されています。新しく記述するコードではlibart_lgpl の代わりに Cairo、およびその他の技術を使用するべきです。

source: Bonobo is a deprecated framework for creating reusable components for use in GNOME applications, built on top of CORBA. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
ja: Bonobo は GNOME アプリケーションで再使用可能なコンポーネントを作成するための非推奨なライブラリであり、CORBA 上に構築されています。Bonobo については <xref linkend="bonobo-corba"/> で議論しています。

source: The deprecated Bonobo UI library provides a number of user interface controls using the Bonobo component framework. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
ja: 非推奨である Bonobo の UI ライブラリです。Bonobo コンポーネント・フレームワークを使用したいくつかのインタフェース・コントロールを提供しています。Bonobo については <xref linkend="bonobo-corba"/> で議論しています。

source: Libglade is a deprecated library for constructing user interfaces dynamically from XML descriptions. Libglade has been deprecated in favor of <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink>. Libglade allows programmers to construct their user interfaces using a graphical interface builder application, and then import those interface definitions. Libglade is discussed in <xref linkend="libglade"/>.
ja: libglade は、XML 記述から動的にユーザインタフェースを構築するための非推奨なライブラリです。Libglade は <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink> に置き換えられました。Libglade によりプログラマはグラフィカルにインタフェースを構築できるアプリケーションでユーザインタフェースを構築し、そのインタフェース定義を後でインポートすることができます。Libglade については <xref linkend="libglade"/> で議論しています。

source: The deprecated libgnome library provides a number of useful routines for building modern applications, including session management, activation of files and URIs, and displaying help.
ja: 非推奨である libgnome ライブラリはセッション管理、ファイルや URI に基づくアクティベーションやヘルプの表示などのモダンなアプリケーション構築のための便利なルーチンをいくつか提供しています。

source: The GnomeCanvas widget provides a flexible widget for creating interactive structured graphics.
ja: GnomeCanvas ウィジェットは構造的なグラフィックを対話的に作成できる柔軟なウィジェットを提供しています。

source: The deprecated libgnomeui library provides additional widgets for applications. Many of the widgets from libgnomeui have already been ported to GTK+.
ja: 非推奨である libgnomeui ライブラリはアプリケーションのために追加のウィジェットを提供します。大部分のウィジェットは GTK+ に移行済みです。

source: The libxml2 library provides a number of APIs for working with XML in a standards-compliant manner. The libxml2 library is discussed in <xref linkend="libxml2"/>.
ja: libxml2 ライブラリは XML を標準に準拠した方法で処理するための API をいくつか提供します。libxml2ライブラリについては <xref linkend="libxml2"/> で議論しています。

source: The libxslt library provides a fast and complete implementation of XSLT, a language for transforming XML. The libxslt library is discussed in <xref linkend="libxslt"/>.
ja: libxslt ライブラリは XML を変換する言語である XSLT の高速で完全な実装です。libxslt ライブラリについては <xref linkend="libxslt"/> で議論しています。

source: Pango is the core text and font handling library used in GNOME applications. It has extensive support for the different writing systems used throughout the world. Pango is discussed in <xref linkend="pango"/>.
ja: Pango は GNOME アプリケーションでテキストやフォントを処理するための中核となるライブラリです。Pango は世界中で使用されている異なる書記体系を広範にサポートします。Pango については <xref linkend="pango"/> で議論しています。

source: Desktop Modules
ja: デスクトップモジュール

source: Modules in the GNOME desktop are not required to make the same API and ABI stability guarantees as modules in the platform, although attempts are made to keep them relatively stable. Often, modules are introduced in the desktop release to mature, and are moved into the platform once they've stabilized.
ja: GNOME デスクトップのモジュールは、たとえそれが比較的安定したものであるとしてもプラットフォームのモジュールとして同じ API、ABI の安定性への保証を要求されていません。大抵、デスクトップのリリースではモジュールは成熟し、安定後にプラットフォームに取り入れられます。

source: The eel library provides a number of additional widgets primarily for use inside <application>Nautilus</application>, the GNOME file manager. Many of the widgets in eel have since been provided in GTK+.
ja: eel ライブラリは主に GNOME のファイルマネージャである <application>Nautilus</application> の内部で使用する追加ウィジェットをいくつか提供します。eel のウィジェットの多くは GTK+ でも提供されます。

source: Evolution Data Server provides a unified location for address book and calendar information, allowing multiple applications to share the same data. Evolution Data Server is discussed in <xref linkend="address-book-calendar"/>.
ja: Evolution データサーバは複数のアプリケーションが同じデータを共有するために、アドレス帳とカレンダのための統一された場所を提供します。Evolution データサーバについては <xref linkend="address-book-calendar"/> で議論しています。

source: In addition to the actual panel, the gnome-panel package provides the libraries used to construct panel applets to run on the user's panel. Panel applets are discussed in <xref linkend="panel-applets"/>.
ja: パネルそのものに加えて、gnome-panel パッケージではユーザのパネルで実行することのできるにパネル・アプレットを構築するのに使用できるライブラリを提供しています。パネル・アプレットについては <xref linkend="panel-applets"/> で議論しています。

source: The GNOME keyring manager provides a modern and secure means of storing users' passwords and other sensitive data. Keys are encrypted and can only be accessed by explicit user permission. The keyring manager is discussed in <xref linkend="keyring"/>.
ja: GNOME キーリング・マネージャはユーザのパスワードや機密データを保存するためのモダンで安全な手段を提供します。キーは暗号化され制限されたユーザ権限のみがアクセスできます。キーリング・マネージャについては <xref linkend="keyring"/> で議論しています。

source: GStreamer is the powerful multimedia used throughout GNOME to play, create, and manipulate sound and video. GStreamer is discussed in <xref linkend="multimedia"/>.
ja: GStreamer は GNOME でサウンドやビデオを再生、作成、操作するための強力なマルチメディア機能です。GStreamer については <xref linkend="multimedia"/> で議論しています。

source: The gtkhtml library provides a lightweight HTML renderer with full support for rich text editing. It is used inside the <application>Evolution</application> mailer to allow users to compose and read HTML email.
ja: gtkhtml ライブラリは豊かなテキスト編集をサポートする軽量な HTML 描画を提供します。gtkhtml は <application>Evolution</application> メールソフトの内部でユーザが HTML を作成・表示するのに使用されています。

source: The gtksourceview library provides an extension of the GtkTextView widget with support for automatic syntax highlighting and other functions that are useful for source code editors. It is used in the <application>gedit</application> text editor.
ja: gtksourceview ライブラリは GtkTextView ウィジェットの拡張であり自動的な構文の強調表示やソースコード・エディタのために便利な機能を提供します。gtksourceviewは <application>gedit</application> テキストエディタで使用されています。

source: GAIL provides an implementation of the ATK interfaces for GTK+ and GNOME libraries, allowing accessibility tools to interact with applications written using these libraries. Accessibility is discussed in <xref linkend="a11y"/>.
ja: GAIL は GTK+ と GNOME ライブラリのための ATK インタフェースの実装を提供し、それらのライブラリを使用して記述されたアプリケーションがアクセシビリティ・ツールと対話することを可能にします。アクセシビリティについては <xref linkend="a11y"/> で議論しています。

source: libgnomeprint is a deprecated library that provides an implementation of the PostScript imaging model. It is superseded by <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. Newly written code should use GtkPrint instead. The GNOME print framework is discussed in <xref linkend="gnomeprint"/>.
ja: 非推奨のライブラリである libgnomeprint は PostScript のイメージング・モデルを実装しています。libgnomeprint は <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink> に置き換えられました。新しく記述するコードでは代わりに GtkPrint を使用するべきです。GNOME プリント・フレームワークについては <xref linkend="gnomeprint"/> で議論しています。

source: libgnomeprintui is a deprecated library that provides a standard print dialog, a print preview dialog, and various other controls required for printing. It is superseded by <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. The GNOME print framework is discussed in <xref linkend="gnomeprint"/>.
ja: 非推奨のライブラリである libgnomeprintui は標準の印刷ダイアログ、印刷プレビューダイアログ、その他の印刷のために必要となるさまざまなコントロールを提供します。libgnomeprintui は <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink> に置き換えられました。GNOME プリント・フレームワークについては <xref linkend="gnomeprint"/> で議論しています。

source: The libgtop library provides a portable API for obtaining information about running processes. It is used in the <application>System Monitor</application> application.
ja: libgtop ライブラリは、実行中のプロセスについての情報を取得するためのポータブルAPI を提供します。libgtop は <application>システムモニタ</application> アプリケーションで使用されています。

source: The librsvg library provides an implementation of Scalable Vector Graphics (SVG). It is used throughout the desktop to render resolution-independent vector graphics.
ja: librsvg ライブラリは、スケーラブルベクターグラフィックス (SVG) の実装を提供します。librsvg はデスクトップの解像度に依存しないベクタグラフィクスをレンダリングするために使用されます。

source: The libsoup library provides an implementation of the Simple Object Access Protocol (SOAP), as well as an HTTP implementation. SOAP can be used to build web services into applications. The libsoup library is discussed in <xref linkend="libsoup"/>.
ja: libsoup ライブラリは SOAP (Simple Object Access Protocol) と、同様に HTTP の実装を提供します。SOAP を使用することによりアプリケーションで Web サービスを構築することができます。libsoup ライブラリについては <xref linkend="libsoup"/> で議論しています。

source: The libwnck library provides a means of controlling any EWMH-compliant window manager, including <application>Metacity</application>, the GNOME default window manager. The libwnck library is discussed in <xref linkend="window-manager"/>.
ja: libwnck ライブラリは GNOME の既定のウィンドウマネージャである <application>Metacity</application> を含む、EWMH 標準準拠のウィンドウマネージャを制御する手段を提供します。libwnck ライブラリについては <xref linkend="window-manager"/> で議論しています。

source: The libxklavier library provides a high-level API for accessing and setting keyboard layouts. It is used in the <application>Keyboard Preferences</application> to allow users to set their keyboard layout and options.
ja: libxklavier ライブラリはキーボードのレイアウトにアクセス・設定するための高レベルの API を提供します。libxklavier は設定メニューの <application>キーボード</application> で、ユーザがキーボードのレイアウトやオプションを設定するために使用されています。
