Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: In addition to launchers and panel applets, the GNOME panel also features a notification area that applications can use to notify users of events. Notifications can be used to alert the user of new emails, available updates, upcoming meetings, or any number of other events.
ja: ランチャやパネルアプレットに加えて GNOME パネルは、アプリケーションがイベントをユーザに通知するために使用できる通知領域を備えています。通知領域は、新しい電子メールをユーザに知らせたり、使用可能なアップデートや会議、その他のさまざまなイベントを通知するのに使用できます。

source: Notifications are simple icons that your application can place in the notification area on the user's panel. Your application can then take further action when the user clicks on the icon. Currently, the notification system is implemented in the experimental Egg library; however, the next version of GTK+ will have support for notification icons.
ja: 通知は、アプリケーションがユーザのパネルの通知領域に配置できるシンプルなアイコンです。ユーザがアイコンをクリックすることによりアプリケーションは、それ以上の処理を行うこともできます。現在のところ、通知システムは、実験的なエッグライブラリによって実装されていますが、GTK+ の次のバージョンでは通知アイコンをサポートする予定です。

source: The notification area is a <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> specification, so your notification icons will appear in other desktop environments as well. For more information on the notification area, see <ulink url="http://standards.freedesktop.org/systemtray-spec/latest/">The System Tray Protocol Specification</ulink>.
ja: 通知領域は <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> で仕様が決められているので、あなたの通知アイコンは他のデスクトップ環境でも表示されます。通知領域の詳細は <ulink url="http://standards.freedesktop.org/systemtray-spec/latest/">The System Tray Protocol Specification</ulink> を参照してください。

source: File Manager
ja: ファイルマネージャ

source: GNOME ships with <application>Nautilus</application>, an intuitive and powerful file manager. Using the advanced GVFS technology, <application>Nautilus</application> is able to display remote folders just like folders on the local file system, giving users access to all their files everywhere with a single consistent interface.
ja: GNOME には直感的で強力なファイルマネージャである <application>Nautilus</application> が同梱されています。GVFS テクノロジを使用することにより <application>Nautilus</application> はリモートシステムのフォルダをローカルのファイルシステムのフォルダと同様に表示できます。それによりユーザは単一の統一されたインタフェースでファイルにアクセスすることができます。

source: <application>Nautilus</application> provides a plugin interface, enabling developers to extend its functionality to provide more information about users' files. This provides a richer and more coherant experience for users, removing the need for seperate applications to manage various types of files.
ja: <application>Nautilus</application> は、ユーザのファイルについてより多くの情報を提供するために機能拡張が可能なプラグイン・インタフェースを提供します。これによりそれぞれのアプリケーションがさまざまなタイプを別々に管理することを排除して、豊かで首尾一貫したユーザ経験を提供することができます。

source: <application>Nautilus</application> plugins can extend the file manager's functionality in a number of ways. Plugins can add extra information to file properties dialogs, providing users with everything they need to know about files. For example, GNOME ships with a plugin to display extra information about audio and video files, such as the codec used, the dimensions of the video, and artist and album of music files extracted from a CD.
ja: <application>Nautilus</application> プラグインはいくつかの方法でファイルマネージャの機能を拡張することができます。プラグインはファイルのプロパティ・ダイアログで追加の情報を追加できるので、ユーザにユーザがファイルについて知るべきすべてのことを提供することができます。たとえば GNOME に同梱されているオーディオやビデオの追加情報を表示するプラグインでは、使用されている CODEC やビデオのサイズ、CD から取得したアーティストやアルバム名などが表示されます。

source: Plugins can also add columns to the list view and automatically place emblems on files. This can be used to provide pertinent information to the user at a glance. For example, a <application>Nautilus</application> plugin could provide version control information on folders checked out from a version control system. Users could see directly in the file manager if a file is up to date, or if changes have been made locally.
ja: プラグインはリストビューに列を追加でき、自動的にファイルのエンブレムを表示します。これにより適切な情報をユーザが一目で判別できるようになります。たとえば <application>Nautilus</application> のプラグインはバージョン管理システムからのチェックアウトに関する情報を表示することができます。ユーザはファイルマネージャからファイルが最新なのか、チェックアウトしたファイルに変更が加えられているかを直接見ることができます。

source: <application>Nautilus</application> also allows developers to add items to the context menu for files and folders. Context menu items can specify for which types of files they should be displayed, so the context menu only provides actions that are relevant for the selected files. For example, <application>File Roller</application>, GNOME's archive file utility, adds an item to the context menu to extract archive files directly. Extra context menu items provide easy access to common operations on different types of files.
ja: <application>Nautilus</application> では開発者がファイルやフォルダのコンテキストメニューに項目の追加もできます。コンテキストメニューの項目は表示するべきファイルがどのファイルタイプに属するのかにより決定されるので、コンテキストメニューには選択されたファイルに関連するアクションだけが表示されます。たとえばGNOME の <application>書庫マネージャ</application> はコンテキストメニューに"ここに展開する"という項目を追加します。コンテキストメニューの拡張により異なるタイプ別に一般的な操作を簡単に行うことが可能になります。

source: In addition to a flexible plugin architecture, <application>Nautilus</application> can also display a thumbnail for any type of file for which a thumbnailer has been provided. Thumbnails show a preview of the file, helping users find the files they want. GNOME can automatically create thumbnails for most image and movie files, and allows applications to install additional thumbnailer programs to create thumbnails for application-specific files. Thumbnail management is fully specified by <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so any thumbnailers you provide can be used by all applications.
ja: 柔軟なプラグインアーキテクチャに加えて、 <application>Nautilus</application> はサムネイル表示が提供されているファイルにたいして任意の種類のサムネイルを表示することもできます。サムネイルにはファイルのプレビューが表示され、ユーザーが必要なファイルを見つける手助けとなります。 GNOME は多くののイメージやムービーファイルのサムネイルを自動的に作成します。またアプリケーションはアプリケーション固有のファイルにたいするサムネイルを作成するために追加でサムネイル作成プログラムをインストールすることができます。サムネイルの管理は <ulink url="http://www.freedesktop.org/"> freedesktop.org</ulink> により完全な仕様が決定されているため、任意のサムネイル作成プログラムをすべてのアプリケーションで使用することができます。

source: Window Manager
ja: ウィンドウマネージャ

source: The window manager is a special program responsible for drawing the borders and titlebars around windows. The window manager is responsible for handling all the operations performed on windows, such as moving, resizing, minimizing, and moving between workspaces. Windows are managed consistently with little or no work from application developers. When applications need to influence the window manager, they can provide hints on their windows using function calls in GTK+.
ja: ウィンドウマネージャはウィンドウの周囲の境界線やタイトルバーの描画受け持つ特別なプログラムです。ウィンドウにたいする移動やサイズ変更、最小化、ワークスペース勘の移動などのすべての操作にたいしてウィンドウマネージャが処理を受け持ちます。ウィンドウはアプリケーション開発者がほとんど処理することなくウィンドウマネージャにより一貫して管理されます。アプリケーションがウィンドウにたいして影響を与える必要がある場合は、GTK+ の関数を使用してウィンドウに対するヒントを提供します。

source: External programs can, however, interact directly with the window manager, and even control its behavior. Using GNOME's libwnck library, applications can get information about the placement and state of all the windows and instruct the window manager to perform various actions on those windows.
ja: しかし外部プログラムが直接ウィンドウマネージャと相互作用したり、動作をコントロールすることもできます。GNOME の libwnck ライブラリを使用すれば、アプリケーションはすべてのウィンドウにたいして位置や情報を取得したり、ウィンドウマネージャに指示を出すことによりそれらのウィンドウにたいしてさまざまなアクションを実行することができます。

source: The libwnck library isn't specific to GNOME's window manager. All of its functionality uses the Extended Window Manager Hints, or EWMH. EWMH was developed jointly with <ulink url="http://www.freedesktop.org">freedesktop.org</ulink> to provide unified window manager interaction across multiple desktops.
ja: libwnck ライブラリは、GNOME のウィンドウマネージャに固有のものではありません。ライブラリのすべての機能は外部のウィンドウマネージャへのヒントか EWMH を通じて行われます。EWMH は複数のデスクトップで統一されたウィンドウマネージャとの対話を提供するために <ulink url="http://www.freedesktop.org">freedesktop.org</ulink> と共同で開発されました。

source: Window manager interaction with libwnck can be used for simple tasks, such as displaying workspace and window list applets on the user's panel, as well as for complex applications, such as performing automatic actions on new windows based on certain window properties.
ja: libwnck を通じてウィンドウマネージャと相互作用することにより、ワークスペースを表示したりユーザパネルのウィンドウをアプレットで一覧したりする簡単な処理や、同様に複雑なアプリケーション、たとえば新しいウィンドウにたいしてウィンドウの特定のプロパティに基づき自動的にアクションを実行することにウィンドウマネージャを使用することができます。

source: Control Center
ja: コントロールセンター

source: The GNOME desktop provides a single menu of all the desktop-wide preferences and system administration settings. Preferences and settings dialogs can be placed in this menu to make them easily accessible. Dialogs can be placed in the preferences menu by adding them to the applications registry with the <literal>Setting</literal> category. Dialogs can be placed in the administration menu using both the <literal>Settings</literal> and <literal>System</literal> categories.
ja: GNOME デスクトップはすべてのデスクトップ全体の設定とシステム管理のために単一のメニューを提供します。設定やシステム管理のダイアログはこのメニューに配置されることにより簡単にアクセスすることができます。アプリケーションを追加するときにカテゴリを <literal>Setting</literal> としておけば設定メニューにダイアログを登録することができます。

source: If you provide a dialog that allows administrators to configure desktop systems, then you should add your dialog to the administration menu. If you provide a dialog that allows users to adjust preferences that affect a number of applications, then you should add your dialog to the preferences menu. You should not use these global menus for individual application preferences.
ja: もしあなたが管理者がデスクトップシステムを設定できるダイアログを提供する場合は、そのダイアログをシステム管理メニューに追加するべきです。複数のアプリケーションに影響を及ぼす設定をユーザに許すようなダイアログを提供する場合は、そのダイアログを設定メニューに追加するべきです。アプリケーションに固有の設定については、これらのグローバルなメニューに追加するべきではありません。

source: Storing Passwords
ja: パスワードの保存

source: GNOME provides a modern and secure keyring manager to store users' passwords and other sensitive data. Applications can use the keyring manager library to store and access passwords, and users can manage their passwords using GNOME's <application>Seahorse</application> application.
ja: GNOME はユーザのパスワードやその他の機密データを格納するために、モダンで安全なキーリング・マネージャを提供します。アプリケーションはパスワードの取得と保存にキーリング・マネージャのライブラリを使用できます。また、ユーザはパスワードを管理するのに GNOME のアプリケーションである <application>パスワードと暗号鍵 (Seahorse)</application> を使用することができます。

source: The keyring manager provides any number of keyrings, where each keyring can contain any number of keyring items. Items in a keyring store some piece of data, often a password. Each keyring is locked individually, and users must provide a password to unlock the keyring. Once a keyring has been unlocked, the user has access to all of the items in that keyring.
de: Die Schlüsselbundverwaltung kann mit mehreren Schlüsselbünden umgehen, wobei jeder Schlüsselbund wiederum eine beliebige Anzahl von Einträgen enthalten kann. Ein Eintrag im Schlüsselbund enthält Daten, zumeist ein Passwort. Jeder Schlüsselbund ist individuell gesperrt, so dass die Benutzer ein Passwort zur Entsperrung bereitstellen müssen. Sobald ein Schlüsselbund entsperrt ist, hat der Benutzer Zugriff auf alle enthaltenen Einträge.
ja: キーリング・マネージャはアイテムをいくつか含むことができる任意の個数のキーリングを提供します。キーリングのアイテムにはデータやパスワードが保存されます。それぞれのキーリングは個別にロックされ、ユーザはロックを解除するためのスワードを提供しなければなりません。キーリングのロックを解除すると、ユーザはキーリングに含まれるすべてのアイテムにアクセスできます。

source: The keyring manager provides access control lists for each keyring item, controlling which applications are allowed access to that item. If an unknown application attempts to access a keyring item, the keyring manager will prompt the user to allow or deny that application access. This helps prevent malicious or poorly-written programs from accessing the user's sensitive data.
de: Die Schlüsselbundverwaltung bietet Zugriffskontrolllisten für jedes Schlüsselbundobjekt, über die Anwendungen Zugriff auf das jeweilige Objekt erhalten können. Falls eine unbekannte Anwendung versucht, Zugriff auf das Schlüsselbundobjekt zu erlangen, fragt die Schlüsselbundverwaltung den Benutzer, ob der Zugriff gewährt oder verweigert werden soll. Das verhindert, dass böswillige oder dürftig programmierte Anwendungen Zugriff auf die sicherheitskritischen Daten des Benutzers erlangen.
ja: キーリング・マネージャは、キーリングのアイテムにたいするアクセス制御リストを提供し、そのアイテムによりアクセスが許可されるアプリケーションを制御します。もし未知のアプリケーションがキーリングのアイテムにアクセスしようとした場合、キーリング・マネージャはユーザにプロンプトを表示してそのアプリケーションのアクセスを許可するか、拒否するかを尋ねます。これにより悪意のあるプログラムや質の悪いプログラムがユーザの機密データにアクセスすることを防ぐことができます。

source: Keyring data stored on the file system is encrypted with the AES block cipher, and SHA1 is used for hashes of the item's attributes. Using the attributes hash, the keyring manager is able to look up items requested by applications without ever unlocking the keyring. The keyring has to be unlocked when a matching item is found and accessed.
de: Die im Dateisystem gespeicherten Daten des Schlüsselbundes werden mit »AES block cipher« gespeichert, wobei SHA1 zur Ermittlung der Prüfsumme der Attribute des Objektes verwendet wird. Aufgrund der Prüfsummen der Attribute ist die Schlüsselbundverwaltung in der Lage, nach den von Anwendungen angefragten Daten zu suchen, ohne den eigentlichen Schlüsselbund entsperren zu müssen. Der Schlüsselbund muss erst dann entsperrt werden, wenn tatsächlich ein passendes Objekt gefunden wurde und darauf zugegriffen wird.
ja: ファイルシステムに保存されたキーリングのデータは AES ブロック暗号化方式で暗号化されアイテムの属性にはハッシュ関数には SHA1 が使用されます。属性のハッシュを使用することにより、キーリング・マネージャはキーリングのロックを解除することなくアプリケーションに要求されたアイテムを見つけることができます。キーリングはアイテムが見つかったときにロックが解除され、アイテムにアクセスすることができるようになります。

source: The keyring manager also provides a session keyring. Items in the session keyring are never stored on disk, and are lost as soon as the user's session ends. The session keyring can be used to store passwords to be used in the current session only.
de: Die Schlüsselbundverwaltung stellt auch einen sitzungsgebundenen Schlüsselbund zur Verfügung. Die Einträge in diesem Schlüsselbund werden niemals dauerhaft gespeichert und gehen verloren, sobald die Sitzung des Benutzers beendet ist. Der Sitzungs-Schlüsselbund kann zum Speichern von Passwörtern genutzt werden, die nur für die aktuelle Sitzung nötig sind.
ja: キーリング・マネージャはセッションのためのキーリングも提供します。セッション・キーリングのアイテムはディスクには決して保存されず、ユーザがセッションを終了すると失われます。セッション・キーリングは現在のセッションだけで使用するパスワードに使用されます。

source: If you use GIO to access remote servers, you automatically get the benefits of the keyring manager. Whenever GVFS needs to authenticate the user, it provides the option to store the password, either in the default keyring or in the session keyring.
de: Falls sie GIO zum Zugriff auf entfernte Server verwenden, nutzen Sie automatisch den Vorteil der Schlüsselbundverwaltung. Wann immer es für GVFS erforderlich ist, den Benutzer zu legitimieren, wird die Option zur Speicherung des Passworts angeboten, entweder im Standard-Schlüsselbund oder im sitzungsgebundenen Schlüsselbund.
ja: もしリモートサーバにアクセスする場合に GIO を使用している場合は、キーリング・マネージャによる恩恵を自動的に享受することができます。GVFS がユーザの認証を必要とする場合、認証に使用するパスワードを既定のキーリングかセッションのキーリングに保存するかのオプションを選択することができます。

source: You should use the keyring manager whenever your application needs to store passwords or other sensitive data for users. Using the keyring manager provides a better user experience while still keeping user data safe and secure.
de: Sie sollten die Schlüsselbundverwaltung immer dann einsetzen, wenn Ihre Anwendung Passwörter oder andere sicherheitsrelevante Daten des Benutzers speichern soll. Die Schlüsselbundverwaltung bietet eine hohe Bedienerfreundlichkeit und hält die Benutzerdaten doch sicher in Verwahrung.
ja: アプリケーションがユーザのパスワードや機密データを保存する必要がある場合はキーリング・マネージャを使用するべきです。キーリング・マネージャを使用することによりユーザのデータを安全かつ確実に保つことができ、よりよいユーザ経験を提供することができます。

source: For API references please see the <ulink url="http://library.gnome.org/devel/gnome-keyring/stable/">gnome-keyring Reference Manual</ulink> and the <ulink url="http://library.gnome.org/devel/libseahorse/stable/">libseahorse Reference Manual</ulink>.
ja: 詳細については、 <ulink url="http://library.gnome.org/devel/gnome-keyring/stable/">gnome-keyring Reference Manual</ulink> と <ulink url="http://library.gnome.org/devel/libseahorse/stable/">libseahorse Reference Manual</ulink> の API リファレンスを参照してください。

source: Session Management
ja: セッションマネージメント

source: GNOME provides tools to allow your application to run smoothly from session to session. Users can log out with running applications and have those applications fully restored when they log back in. To provide this functionality, your application must connect to the session manager and save its state when the user logs out.
ja: GNOME はセッション間でアプリケーションを円滑に実行するためのツールを提供します。ユーザがログアウトしたときに実行されていたアプリケーションは、ユーザが再びログインしたときに復元されます。この機能を提供するためにはアプリケーションがセッションマネージャと接続して、ユーザがログアウトしたときに状態を保存しなければなりません。

source: Note that this section is outdated as GnomeClient and Libgnomeui are deprecated. Newly written code should use <ulink url="http://live.gnome.org/SessionManagement/EggSMClient">EggSMClient</ulink> instead. Work is currently underway to integrate EggSMClient directly into GTK+. API and ABI stability guarantees ensures that GnomeClient will continue to be functional and supported throughout the GNOME 2 lifecycle.
ja: このセクションは GnomeClient と Libgnomeui が時代遅れになるのに伴い陳腐化していることに注意してください。新しく記述するコードでは <ulink url="http://live.gnome.org/SessionManagement/EggSMClient">EggSMClient</ulink> を代わりに使用するべきです。EggSMClient を直接 GTK+ に統合することは作業は現在進行中です。API と ABI による安定性は GnomeClient の機能が GNOME2 の提供期間を通じてサポートされることを保証します。

source: GNOME provides a simple API for session management in the GNOME User Interface Library. See the section <ulink url="http://library.gnome.org/devel/libgnomeui/stable/GnomeClient.html">GnomeClient</ulink> of the <ulink url="http://library.gnome.org/devel/libgnomeui/stable/">GNOME UI Library Reference Manual</ulink> for more information on working with the GNOME session manager.
ja: GNOME は GNOME ユーザインタフェース・ライブラリによりシンプルなセッションマネージメントの API を提供します。GNOME セッションマネージャについての詳細は <ulink url="http://library.gnome.org/devel/libgnomeui/stable/">GNOME UI Library Reference Manual</ulink> の <ulink url="http://library.gnome.org/devel/libgnomeui/stable/GnomeClient.html">GnomeClient</ulink> を参照してください。

source: Address Book and Calendar
ja: アドレス帳とカレンダ

source: With Evolution Data Server, GNOME provides a single address book and calendar that all applications can use to store and retrieve information. Using Evolution Data Server means that users no longer have to maintain separate lists of contacts in each application, or manually copy events to their calendar.
de: Mit dem »Evolution Data Server« bietet GNOME ein Adressbuch und einen Kalender, den alle Anwendungen zum Speichern und Abfragen von Informationen verwenden können. Benutzer brauchen dadurch nicht mehr separate Kontaktlisten in den verschiedenen Anwendungen zu verwalten oder per Hand Ereignisse in .den Kalender zu kopieren
ja: Evolution データサーバにより、GNOME はすべてのアプリケーションが情報を保存・取得することができる単一のアドレス帳とカレンダを提供します。Evolution データサーバを使うということはユーザがそれぞれのアプリケーションの連絡先を分割管理する必要がなくなり、それらのカレンダに手動でイベントをコピーする必要がなくなることを意味します。

source: People use computers increasingly to interact with their friends and colleagues. Applications such as email programs, instant messengers, and telephony and video conferencing applications are used to communicate with others. These applications often provide contact lists to help users. Using Evolution Data Server, applications can store contact information in a single location, allowing all applications to see all the pertinent data about users' contacts.
de: Leute, die Rechner benutzen, wollen in immer mehr zunehmendem Maße mit Freunden oder Kollegen in Verbindung treten. Anwendungen wie E-Mail-Programme, Sofortnachrichtendienste oder Videokonferenzen werden zur Kommunikation mit anderen benutzt. Diese Anwendungen stellen oft Kontaktlisten bereit, um den Benutzer zu unterstützen. Bei der Verwendung von »Evolution Data Server« können Anwendungen jegliche Kontaktinformationen an einem zentralen Ort speichern, was allen Anwendungen die für Kontakt relevanten Daten zur Verfügung stellt.
ja: 人々が友人や同僚と対話するのにコンピュータを使用する機会はますます増加しています。電子メール、インスタント・メッセンジャー、テレフォニー、そしてビデオ会議はいずれも他の人と対話するのに使用されるアプリケーションです。これらのアプリケーションはユーザのためにしばしば連絡先一覧を提供します。Evolution データサーバを使用すればアプリケーションは連絡先の情報を1ヶ所に保存することができ、すべてのアプリケーションがユーザの連絡先と関連するデータを参照することができます。

source: Applications can also use Evolution Data Server to store and retrieve appointments on the user's calendar. For example, the clock on the panel shows a simple calendar when clicked. If the user has any appointments scheduled, they are shown alongside the calendar. This makes it easy to see upcoming appointments without opening a full calendar application.
de: Anwendungen können den »Evolution Data Server« ebenfalls dazu verwenden, Einträge des Benutzerkalenders zu speichern oder abzufragen. Beispielsweise zeigt die Uhr im Panel beim Anklicken einen einfachen Kalender an. Falls der Benutzer Termine eingetragen hat, werden diese im Kalender angezeigt. Dadurch wird die Anzeige von Terminen erleichtert, da das Öffnen einer kompletten Kalender-Anwendung nicht nötig ist.
ja: Evolution データサーバを使用すればアプリケーションがユーザのカレンダに予定を保存・取得することもできます。たとえば、パネルに表示されている時計をクリックするとシンプルなカレンダが表示されます。もしユーザが予定をスケジュールしていた場合は、そのカレンダに予定が表示されます。これによりユーザはカレンダのためのアプリケーションを開くことなく簡単に予約を確認することができます。

source: For more information on the address book, see <ulink url="http://gnome.org/projects/evolution/developer-doc/libebook/ch01.html"> Evolution API Reference: libebook</ulink>. For more information on the calendar, see <ulink url="http://gnome.org/projects/evolution/developer-doc/libecal/index.html"> Evolution API Reference: libecal</ulink>.
ja: アドレス帳についての詳細は <ulink url="http://gnome.org/projects/evolution/developer-doc/libebook/ch01.html"> Evolution API Reference: libebook</ulink> を参照してください。カレンダについての詳細は <ulink url="http://gnome.org/projects/evolution/developer-doc/libecal/index.html"> Evolution API Reference: libecal</ulink> を参照してください。

source: Usability
ja: ユーザビリティ

source: The GNOME desktop is designed around usability, and it aims to provide a consistent and simple user experience. People use computers to get work done (or to play!), not to figure out complicated user interface puzzles. When designing your application, you should consider how well users can recognize common user interface paradigms, how quickly they can learn the elements that are unique to your application, and how efficiently they can execute tasks once they've learned them.
ja: GNOME デスクトップは使いやすさを基にデザインされ、シンプルで一貫したユーザ経験を提供します。人々はコンピュータを使用して仕事(遊び?)をするのに複雑なユーザインタフェースのパズルを解読する必要はありません。アプリケーションをデザインする場合、どのようにしてユーザが一般的なユーザインタフェースの使い方を認識するか、アプリケーションに固有の要素についてどれだけ早く習熟することができるか、そしてユーザがそれらを習熟した後にどれだけ効果的に作業を行うことができるか、について考慮すべきです。

source: GNOME provides comprehensive Human Interface Guidelines to help you write applications that are attractive and usable. While no guidelines can provide a single answer for all usability concerns, understanding the GNOME Human Interface Guidelines can make it easier to create a usable application. For more information, please see the <ulink url="http://library.gnome.org/devel/hig-book/stable/">GNOME Human Interface Guidelines</ulink>.
ja: GNOME はあなたが魅力的で使いやすいアプリケーションを作成するための包括的なヒューマンインターフェースのガイドラインを提供しますユーザビリティの問題について単一の解を提供できるガイドラインはありませんが、GNOME ヒューマンインタフェース・ガイドラインは簡単で使いやすいアプリケーションを作成するのを簡単にしてくれます。詳細については <ulink url="http://library.gnome.org/devel/hig-book/stable/">GNOME Human Interface Guidelines</ulink> を参照してください。

source: Documentation
ja: ドキュメンテーション

source: All applications should provide documentation to help their users understand the application and troubleshoot problems that may arise. While a well-designed application should not require reading the documentation before use, documentation can nonetheless be an important tool for users, particularly for complex applications.
ja: すべてのアプリケーションは、ユーザがアプリケーションを理解し、問題解決を手助けするためのドキュメントを提供するべきです。うまくデザインされたアプリケーションでは使用する前にドキュメントを読む必要がないとしても、ドキュメントはユーザにとって、とくに複雑なアプリケーションの場合は重要なツールなのです。
