Repository: GNOME/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: de, ja

source: Platform Overview
ja: プラットフォームの概要

source: The GNOME platform provides a comprehensive development environment for graphical applications and other software. Using the technologies in GNOME, you can create high-quality software to meet and exceed your users' expectations. This chapter provides a very brief overview of the components that are discussed in this document.
ja: GNOME プラットフォームは、グラフィカルなアプリケーション、それ以外のアプリケーションにたいして使いやすい開発環境を提供します。GNOME の技術を使用することで、あなたはユーザの期待を上回る高品質なソフトウェアを作ることができます。この章では、このドキュメントで議論しているコンポーネントのおおまかな概要を提供します。

source: Core Technologies
ja: 中核となる技術

source: GNOME provides a number of libraries for constructing attractive graphical interfaces. It provides libraries for displaying and manipulating common user interface controls, for laying out and rendering text from most of the world's writing systems, and for drawing sophisticated vector graphics to the screen. The graphical technologies in GNOME are outlined in <xref linkend="graphics"/>.
ja: GNOME は魅力的なグラフィカル・インタフェースを構築するために、いくつかのライブラリを提供します。それらのライブラリは一般的なユーザ・インタフェースのコントロールの表示と操作、多くの国々の書記体系によるテキストのレイアウトおよびレンダリング、複雑なベクタ・グラフィクスをスクリーンに描画します。GNOME のグラフィック技術については <xref linkend="graphics"/> で概説します。

source: The GIO library in GLib, together with the GVFS backend, provides a file system abstraction that allows users to work with files on remote servers as well as the local file systems. GIO provides a high-level API for file operations, making development fast and easy. Using GIO will allow your application to support remote files and folders automatically. GIO and GVFS are discussed in <xref linkend="gio"/>.
ja: GLib の GIO ライブラリは GVFS バックエンドとともに、ユーザがリモートサーバ上のファイルにたいしてローカルのファイルシステムと同じように作業することができる、抽象化されたファイルシステムを提供します。GIO はファイル操作のための高レベルのAPI を提供し、開発を迅速で簡単にします。GIO を使用することによりアプリケーションでリモートのファイルとフォルダを自動的にサポートすることができます。GIO とGVFS については <xref linkend="gio"/> で議論します。

source: GNOME provides the GConf library and daemon for storing and retrieving user preferences. GConf has a simple API that makes it easy to provide instant-apply preferences in your application. Using GConf also allows administrators to provide default and mandatory application settings for their users. GConf is discussed in <xref linkend="gconf"/>.
ja: GNOME はユーザの設定を保存、取得するために、GConf ライブラリとデーモンを提供します。GConf には、あなたのアプリケーションに設定を即時に適用するためのシンプルな API があります。GConf を使用することにより、管理者はユーザにたいして既定、および必須のアプリケーション設定を提供することができます。GConf については <xref linkend="gconf"/> で議論します。

source: GNOME provides facilities for internationalization and accessibility, helping you reach the largest possible number of potential users. Much of the internationalization and accessibility support is built right in, but there are many issues you should be aware of when developing applications. Internationalization is discussed in <xref linkend="i18n"/>. Accessibility is discussed in <xref linkend="a11y"/>.
ja: GNOME が提供するインターナショナライゼーションおよびアクセシビリティの仕組みにより、あなたは最大限可能な潜在的ユーザを獲得することができます。多くのインターナショナライゼーションおよびアクセシビリティのサポートは正しく構築されていますが、開発時には多くの考慮すべき点があります。インターナショナライゼーションについては <xref linkend="i18n"/> で議論します。また、アクセシビリティについては <xref linkend="a11y"/> で議論します。

source: GNOME ships with GStreamer, an extremely powerful multimedia framework for creating, editing, and playing audio and video content. GStreamer is discussed in <xref linkend="multimedia"/>.
ja: GNOME にはオーディオやビデオのコンテンツを作成、編集、再生が可能な極めて強力なマルチメディア・フレームワークである GStreamer が付属しています。GStreamer については <xref linkend="multimedia"/> で議論します。

source: GNOME also provides a complete print framework which leverages CUPS whenever possible. The print framework in GNOME allows you to provide a consistent interface to high-quality printing. The print framework is discussed in <xref linkend="printing"/>.
ja: GNOME は可能な場合には CUPS を利用する完全な印刷フレームワークを提供します。GNOME の印刷フレームワークにより高品質な印刷のための統一されたインタフェースを提供することができます。印刷フレームワークについては <xref linkend="printing"/> で議論します。

source: IPC and Networking
ja: IPC とネットワーク

source: The GNOME desktop has full support for transferring data using the clipboard or with drag and drop. The APIs in GTK+ can help you create applications that interoperate well with the rest of the desktop. Clipboard and drag and drop functionality are discussed in <xref linkend="clipboard"/>.
ja: GNOME デスクトップはクリップボード、ドラッグアンドドロップによるデータ転送をフルサポートしています。GTK+ の API はデスクトップの他の部分と正常に相互作用するアプリケーションを作る助けとなります。クリップボードとドラッグアンドドロップの機能については <xref linkend="clipboard"/> で議論します。

source: With <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, GNOME provides the D-Bus messaging system. D-Bus is a cross-desktop message bus which allows all types of applications to communicate with one another. D-Bus is discussed in <xref linkend="dbus"/>.
ja: <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> と共にGNOME は D-Bus メッセージング・システムを提供します。D-Bus はすべての種類のアプリケーションが他のアプリケーションと通信するためのクロスデスクトップ・メッセージバスです。D-Bus については <xref linkend="dbus"/> で議論します。

source: GNOME features the Bonobo component system, built on top of CORBA. Bonobo allows programmers to create complex embeddable components which can be reused inside other programs. Note that Bonobo has been deprecated. Newly written code should use D-Bus and other technologies instead. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
ja: GNOME は CORBA 上に構築された Bonobo コンポーネントシステムを備えています。Bonoboはプログラマが他のプログラムで再利用することができる複雑な埋め込みコンポーネントを作成することを可能にします。Bonobo の使用は推奨されていないことに注意してください。新しく記述するコードには代わりに D-Bus および、その他の技術を使用するべきです。Bonobo については <xref linkend="bonobo-corba"/> で議論しています。

source: To make networks more manageable for users, GNOME supports DNS Service Discovery. DNS Service Discovery enables applications to find services automatically on a local network, rather than requiring users to provide network addresses. DNS Service Discovery is discussed in <xref linkend="dns-sd"/>.
ja: ユーザがネットワークをより管理しやすくするために、GNOME は DNS サービスディスカバリを提供します。。DNS サービスディスカバリは、ユーザにネットワークアドレスの入力を促すことなく、アプリケーションがローカルネットワーク上のサービスを自動的に探し出すことを可能にします。DNS サービスディスカバリについては <xref linkend="dns-sd"/> で議論します。

source: Finally, GNOME provides a number of libraries for working with XML and web services. These technologies are becoming increasingly important to application developers. XML and web services are discussed in <xref linkend="xml-web-services"/>.
ja: 最後に、GNOME は XML と Web サービスを操作するためのライブラリをいくつか提供します。これらの技術はアプリケーションの開発者にとって重要性を増しています。XML とWeb サービスについては <xref linkend="xml-web-services"/> で議論します。

source: Desktop Technologies
ja: デスクトップテクノロジ

source: The GNOME desktop features numerous places where applications can provide better integration, such as providing panel applets or plugins for the file manager. Many of these features are discussed in <xref linkend="desktop-tech"/>.
ja: GNOME デスクトップはパネル・アプレットやファイルマネージャのプラグインのように、アプリケーションがよりよく統合されるための場所をいくつか提供します。それらの多くについては <xref linkend="desktop-tech"/> で議論します。

source: GNOME provides comprehensive Human Interface Guidelines to help you create more usable applications. GNOME's usability standards were a first among free desktop environments, and they continue to improve through GNOME's commitment to a better user experience. Usability is discussed in <xref linkend="usability"/>.
ja: GNOME はより使いやすいアプリケーションを作成するための、包括的なヒューマンインターフェースのガイドラインを提供します。GNOME のユーザビリティ標準は当初のフリーなデスクトップ環境の中に含まれていました。そして GNOME のコミットメントを通じてよりよいユーザ経験のために改善を続けていきます。ユーザビリティについては <xref linkend="usability"/> で議論します。

source: GNOME also provides a complete help system, as well as style guidelines for writing documentation. Though often under-appreciated, good user help can significantly improve your software. Documentation is discussed in <xref linkend="documentation"/>.
ja: GNOME は完全なヘルプシステムと、ドキュメントを記述するためのスタイルガイドラインを提供します。アプリケーションが既に高い評価を受けていたとしても、上質なユーザ用のヘルプシステムによりソフトウェアを大幅に改善することができます。ドキュメンテーションについては <xref linkend="documentation"/> で議論します。

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
ja: この文書を、フリーソフトウェア財団発行の GNU フリー文書利用許諾契約書 (GFDL) のバージョン 1.1 かそれ以降が定める条件の下で複製、頒布、あるいは改変することを許可します。変更不可部分、表カバーテキスト、裏カバーテキストは存在しません。この利用許諾契約書 (GFDL) の複製は<ulink type="help" url="ghelp:fdl">このリンク</ulink> またはこのマニュアルと一緒に配布されているファイル COPYING-DOCS を参照してください。

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
ja: このマニュアルは GFDL の下で配布される GNOME マニュアルのコレクションの一部です。コレクションと別にこのマニュアルを配布したい場合は、ライセンスの第六節にあるようにライセンスのコピーをマニュアルに加えれば配布できます。

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
ja: 製品やサービスを区別するために企業によって利用されている名称の多くは登録商標です。これらの名称が GNOME ドキュメントで使われていて GNOME ドキュメントプロジェクトのメンバーが商標と認識している場合、これらの名前を大文字あるいは語句の最初の文字を大文字で記述しています。

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
ja: ドキュメントおよび変更されているドキュメントは次の GNU フリー文書利用許諾契約書 (GFDL) の下で頒布されます: <placeholder-1/>

source: Clipboards and Drag and Drop
ja: クリップボードとドラッグアンドドロップ

source: As users work with more and more types of data in different applications, they have an increasing need to share objects and data between their applications. GNOME supports two related methods for transfering data between applications: using drag and drop operations, and copying to and pasting from a system-wide clipboard. Both the clipboard and drag and drop work across multiple applications, including those not developed with GNOME.
ja: ユーザが異なるアプリケーションでさまざまな種類のデータを処理するようになるにつれアプリケーション間でオブジェクトやデータを共有する必要は増加してきまた。GNOME はアプリケーション間でのデータ転送に関連する2つの方法をサポートします:ドラッグアンドドロップ操作の使用と、システム規模のクリップボードを介したコピーおよびペーストです。クリップボードとドラッグアンドドロップは複数のアプリケーション間で機能し、GNOME で開発されていないアプリケーションもそれに含まれます

source: The clipboard is used when a user explicitly copies data in an application. The application then claims ownership of the clipboard. When the user pastes the data into another application, that application requests the clipboard data from the first application. Clipboard operations are fully supported in GTK+.
ja: クリップボードはアプリケーションのデータに対してユーザが明示的にコピーの操作を行ったときに使用されます。それによりアプリケーションはクリップボードの所有権を主張したことになります。ユーザが他のアプリケーションでペーストの操作を行ったときは、そのアプリケーションから最初のアプリケーションに対してクリップボードのデータが要求されます。クリップボードの操作は GTK+ でフルにサポートされています。

source: Drag and drop operations are similar, but they require the pointer to be tracked and updated as the user moves across potential drop targets. When an application is notified a pointer is moving over it during an active drag, it must update the cursor to indicate whether or not it can accept the drop. GTK+ provides drag and drop support with a sophisticated API that makes it easy to manage drop targets in your applications.
ja: ドラッグアンドドロップも同様の操作ですが、ポインタを追跡してドロップするターゲットとなる可能性がある対象の上を通過する場合は、カーソルを更新することが要求されます。アプリケーションはドラッグ中にポインタが上を通過すると通知を受けます。そのときアプリケーションはカーソルを更新すしてドロップを受け入れられるかどうかを示さなければなりません。GTK+ はドロップされるターゲットをアプリケーションで管理するのを容易にする、洗練された API によってドラッグアンドドロップをサポートします。

source: Both the clipboard and drag and drop operations support content negotation. When an application has data to offer, it advertises which formats are available for that data. Receiving applications can request the most suitable formats. For instance, if a user copies text from a web browser, a word processor can maintain formatting by requesting the data in HTML, while a plain text editor can receive the text without formatting.
ja: クリップボードとドラッグアンドドロップ操作はどちらもコンテンツのネゴシエーションをサポートします。アプリケーションが提供すべきデータを持っているときは、そのデータに関してどのようなフォーマットが有効なのかを提示します。データを受け取るアプリケーションは最も適切なフォーマットを要求します。たとえばユーザがウェブブラウザからテキストをコピーした場合、ワードプロセッサは受け取るデータが HTML フォーマットでも管理できるた め HTML フォーマットを要求し、通常のテキストエディタはフォーマットなしのテキストを要求します。

source: You should provide clipboard and drag and drop functionality for any data your application operates on. The clipboard and drag and drop are useful for more than just text: files, graphics, and sound clips are all examples of data that can be transferred between applications. When you use GTK+, you automatically get clipboard and drag and drop support for text areas, color buttons, file choosers, and other built-in user interface controls. You should use the APIs in GTK+ to provide support for any other data in your application.
ja: あなたはあなたのアプリケーションで操作するデータにたいして、クリップボードとドラッグアンドドロップの機能を提供するべきです。クリップボードとドラッグアンドドロップはテキストにたいしてだけではなく、他のデータにたいしても便利な機能です: ファイル、グラフィック、そしてサウンド・クリップなどはどれもアプリケーション間で転送が可能なデータの例です。GTK+ を使用すれば、テキストアリア、カラーボタン、ファイル選択、その他の組み込み済みのユーザインタフェース・コントロールで自動的にクリップボードとドラッグアンドドロップのサポートを享受することができます。アプリケーションで使用するその他のデータにたいするサポートを提供するためにも GTK+ の API を使用するべきです。

source: For more information, see <ulink url="http://www.newplanetsoftware.com/xdnd/">Drag-and-Drop Protocol for the X Window System</ulink>, <ulink url="http://standards.freedesktop.org/clipboards-spec/clipboards-latest.txt">X Clipboard Explanation</ulink>, and <ulink url="http://freedesktop.org/wiki/ClipboardManager">The Clipboard Manager Specification</ulink>.
ja: 詳細については <ulink url="http://www.newplanetsoftware.com/xdnd/">Drag-and-Drop Protocol for the X Window System</ulink>、<ulink url="http://standards.freedesktop.org/clipboards-spec/clipboards-latest.txt">X Clipboard Explanation</ulink>、そして <ulink url="http://freedesktop.org/wiki/ClipboardManager">The Clipboard Manager Specification</ulink> を参照してください。

source: D-BUS Messaging
ja: D-BUS メッセージ

source: D-Bus is a cross-desktop message bus for sending events between various applications, the desktop, and low-level components of the system. D-Bus provides a simple API for sending messages to particular services and for broadcasting messages to all interested services. D-Bus enables different types of applications to communicate and integrate with each other and with the desktop, providing better interaction and a richer experience for the user.
de: D-BUS ist ein Plattform übergreifendes Nachrichtensystem zum Senden von Ereignismeldungen zwischen verschiedenen Anwendungen sowie den eingebauten Komponenten des Systems. D-BUS stellt eine einfache Schnittstelle zum Senden von Nachrichten zu bestimmten Diensten und für die Verbreitung von Meldungen an alle interessierten Dienste dar. D-BUS ermöglicht die Kommunikation zwischen verschiedenen Anwendungstypen und deren gemeinsame Integration in die Arbeitsumgebung, wobei eine bessere Interaktion durch den Benutzer erreicht wird.
ja: D-Bus はさまざまなアプリケーション、デスクトップ、システムの低レベルのコンポーネント間でイベントを送信するための、クロス・デスクトップのメッセージバスです。D-Bus は特定のサービスのためにメッセージを転送したり、関心を持つサービスにたいしてメッセージをブロードキャストするためのシンプルな API を提供します。D-Bus は異なる種類のアプリケーションとデスクトップが互いに通信、統合されることにより、よりよい相互作用とより豊かなユーザ経験を提供します。

source: D-Bus provides a session and a system bus. The session bus is used by applications in a single user session, allowing them to share data and event notifications and to integrate into the user's desktop. For example, movie players can send a D-Bus message to prevent the screensaver from activating when the user is watching a movie.
de: D-Bus stellt einen Sitzungs- und einen Systembus bereit. Der Sitzungsbus wird von Anwendungen in einer einzelnen Benutzersitzung verwendet, was den Anwendungen die Freigabe von Daten und Benachrichtigungen über Ereignisse sowie die Integration in die Arbeitsumgebung des Benutzers ermöglicht. Beispielsweise können Video-Wiedergabeprogramme eine D-Bus-Meldung senden, um die Aktivierung des Bildschirmschoners zu verhindern, wenn der Benutzer ein Video abspielt.
ja: D-Bus はセッションとシステムバスを提供します。セッションバスは単一のユーザセッションでアプリケーションによって使用され、アプリケーションのデータ共有やイベントの通知、そしてユーザのデスクトップへの統合を可能にします。たとえば、ムービープレーヤーは D-BUS にメッセージを送ることによりユーザがムービーを見ているときはスクリーンセーバーの起動を抑止することができます。

source: The system bus is a single message bus which runs independently of any user sessions. It can communicate with applications in any session, enabling those applications to interact with system components without dealing with low-level system details. The system bus is used to provide important functionality that users expect to work on their systems. For example, the system bus is used to monitor when network interfaces go up or down, when external drives get plugged in, and when laptop batteries are low.
de: Der Systembus ist ein einzelner Nachrichtenbus, der unabhängig von einer Benutzersitzung läuft. Er kann mit Anwendungen in einer beliebigen Sitzung kommunizieren, wobei diesen Anwendungen die Interaktion mit Systemkomponenten ermöglicht wird, ohne auf Low-Level-Details des Systems zurückgreifen zu müssen. Der Systembus wird verwendet, um wichtige Funktionalitäten bereitzustellen, die der Benutzer erwartet. Beispielsweise überwacht der Systembus Vorgänge wie das Aktivieren oder Deaktivieren von Netzwerkschnittstellen, das Anschließen externer Laufwerke oder die Kapazität der Laptop-Akkus.
ja: システムバスはユーザセッションとは独立して実行される単一のメッセージバスです。システムバスはアプリケーションと通信することにより、それらのアプリケーションがシステムの低レベルな詳細を知ることなくシステムコンポーネントと相互作用することを可能にします。システムバスはユーザが彼らのシステムで動作することを期待するであろう重要な機能を提供します。たとえば、システムバスはネットワークインタフェースの UP / DOWN や外部デバイスがプラグインされたり、ラップトップのバッテリが低下するのをモニタするのに使用されます。

source: D-Bus is developed jointly on <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so you can use it with different desktop environments and applications. Because D-Bus is a cross-desktop project, you use it to create portable and versatile software that seamlessly integrates with the user's desktop, regardless of which desktop it is.
ja: D-Bus は <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> と共同で開発されたため、異なるデスクトップ環境やアプリケーションで使用することができます。D-Bus はクロス・デスクトップのプロジェクトです。そのためユーザのデスクトップにシームレスに統合でき、多目的で可搬性のあるソフトウェアの作成に使用できます。

source: For more information on D-Bus, see <ulink url="http://dbus.freedesktop.org/doc/dbus-tutorial.html">The D-BUS Tutorial</ulink> and <ulink url="http://dbus.freedesktop.org/doc/dbus-specification.html">The D-BUS Specification</ulink>.
ja: D-Bus についての詳細は <ulink url="http://dbus.freedesktop.org/doc/dbus-tutorial.html">The D-BUS Tutorial</ulink> と <ulink url="http://dbus.freedesktop.org/doc/dbus-specification.html">The D-BUS Specification</ulink> を参照してください。

source: Bonobo and CORBA
ja: Bonobo および CORBA

source: Note that Bonobo, libIDL and ORBit have been deprecated in favor of D-Bus and other technologies. See above.
ja: Bonobo、libIDL、および ORBit は、D-Bus やその他の技術に置き換えられたため使用は推奨されていないことに注意してください(前記参照)。

source: Bonobo is a framework for creating reusable components for use in applications. Built on top of the industry-standard Common Object Request Broker Architecture (CORBA), Bonobo provides all the common interfaces needed to create and use well-behaved components in GNOME applications.
ja: Bonobo はアプリケーションで再使用可能なコンポーネントを作成するためのフレームワークです。業界標準である CORBA (Common Object Request Broker Architecture) を基に構築され、GNOME アプリケーションで安心して使用できるコンポーネントを作成、使用するために必要となるすべての共通インタフェースを提供します。

source: Bonobo components can be used in a variety of situations, and can help create flexible and extensible software. For example, a component to display multimedia content could be embedded inside a word processor, effectively adding multimedia support to the word processor without the word processor working directly with it. Bonobo components are also used to embed the applets in the GNOME panel. Using Bonobo enables the applets to communicate effectively with the panel, affording users a consistent interface.
ja: Bonobo のコンポーネントはさまざまな場面で使用でき、柔軟で拡張性のあるソフトウェアを作成する助けとなります。たとえば、マルチメディアのコンテンツを表示するコンポーネントをワードプロセッサに埋め込むことにより、ワードプロセッサが直接マルチメディアを処理することなく、ワードプロセッサにマルチメディアのサポートを追加することができます。Bonobo コンポーネントは GNOME パネルにアプレットを埋め込むのにも使用されています。Bonobo を使用することによりアプレットが効果的にパネルと通信することが可能になり、ユーザに統一されたインタフェースを提供することができます。

source: Bonobo components are not limited to graphical controls. Bonobo was used by Evolution, GNOME's email and groupware suite, to provide access to users' addressbook and calendar. This allows users to keep all their information in one place, where all applications can access it.
ja: Bonobo のコンポーネントはグラフィカルなコントロールとは限りません。Bonobo はGNOME の電子メールクライアントでありグループウェア・スィートでもある Evolution で、アドレス帳やカレンダへのアクセスに使用されていました。これによりユーザは自分の情報を1ヶ所に保存して、すべてのアプリケーションがアクセスできるようにしたのです。

source: Bonobo is built off of CORBA, allowing components to run in seperate processes. Components can be written in different languages and run on top of different runtimes; they need only adhere to an interface specified with the Interface Definition Language (IDL). CORBA's flexible design even allows components to run on seperate machines over a network.
ja: Bonobo は CORBA 上に構築されているため、コンポーネントを独立したプロセスで実行することができます。コンポーネントは異なる言語で記述でき、異なるランタイム上で実行することができます。; 唯一必要なのはインタフェースが IDL (Interface Definition Language) で記述されていなければならないということだけです。CORBA の柔軟なデザインによりネットワーク上の異なるマシンのコントロールを実行することさえ可能です。

source: GNOME provides its own fast and lightweight CORBA implementation with ORBit. The tools and libraries supplied with GNOME even allow components to be written effectively in C, a language often excluded by other CORBA implementations. ORBit is an incredibly fast CORBA implementation.
ja: GNOME は、高速で軽量な CORBA 実装である ORBit を提供します。GNOME により供給されるツールとライブラリは、C言語や他の CORBA 実装では使用できない言語でも効果的にコンポーネントを記述することが可能です。

source: Bonobo helps fill the gaps in CORBA, providing the additional interfaces and specifications needed to support consistent components. Although you will rarely need to use CORBA without Bonobo, it can be used directly. For instance, GNOME's accessibility infastructure uses CORBA to allow assistive tools to inspect and interact with running applications.
ja: Bonobo は CORBA に欠けている、一貫したコンポーネントサポートするために必要な追加のインタフェースと仕様を提供することによって、そのギャップを埋める手助けをします。Bonobo を使わずに CORBA を使用することはほとんどないでしょうが、直接 CORBA を使用することも可能です。たとえば、GNOME アクセシビリティの基盤は CORBA により、実行中のアプリケーションを調査・対話する援助ツールを実現しています。

source: You may wish to use Bonobo to provide complex graphical components that can be embedded into applications. For most IPC needs, however, GNOME is moving towards D-Bus, as integrating D-Bus into applications is considerably easier.
ja: あなたはグラフィカルで複雑な埋め込み可能コンポーネントを提供するために Bonobo を使用したいと思うかもしれません。しかし大部分の GNOME における IPC の必要性は D-Bus へと移行しつつあります。アプリケーションを D-Bus に統合することでそれらは大幅に簡単になります。

source: For more information on Bonobo, see the <ulink url="http://library.gnome.org/devel/libbonobo/stable/">Libbonobo Reference Manual</ulink> and the <ulink url="http://library.gnome.org/devel/libbonoboui/stable/">LibbonoboUI Reference Manual</ulink>. For information on ORBit, GNOME's CORBA implementation, see the <ulink url="http://library.gnome.org/devel/ORBit2/stable/">ORBit2 Reference Manual</ulink>.
ja: Bonobo についての詳細は <ulink url="http://library.gnome.org/devel/libbonobo/stable/">Libbonobo Reference Manual</ulink> および <ulink url="http://library.gnome.org/devel/libbonoboui/stable/">LibbonoboUI Reference Manual</ulink> を参照してください。GNOME の CORBA 実装である ORBit についての詳細は <ulink url="http://library.gnome.org/devel/ORBit2/stable/">ORBit2 Reference Manual</ulink> を参照してください。

source: Service Discovery
ja: サービス・ディスカバリ

source: DNS Service Discovery, or Zeroconf, is a technology for automatically locating available services on a network. Zeroconf allows users to access network resources without having to provide explicit addresses or configure their applications manually.
ja: DNS サービス・ディスカバリや Zeroconf は、ネットワーク上で使用可能なサービスを自動的に探し出すための技術です。Zeroconf はアドレスを明示的に提供したりアプリケーションの手動で設定することなしに、ユーザがネットワークのリソースにアクセスすることを可能にします。
