Repository: GNOME/gnome-devel-docs
Catalog: style-guide/*/*.po
Languages: de

source: @@image: 'media/button.png'; md5=THIS FILE DOESN'T EXIST
de: a

source: @@image: 'media/list.png'; md5=THIS FILE DOESN'T EXIST
de: a

source: @@image: 'media/checkbox.png'; md5=THIS FILE DOESN'T EXIST
de: a

source: The terms to use when referring to a widget in the user interface.
de: Zu verwendende Begriffe, wenn Sie auf ein Element der Benutzeroberfläche Bezug nehmen.

source: GNOME Documentation Project
de: GNOME-Dokumentationsprojekt

source: Button
de: Knopf

source: Examples of buttons.
de: Beispiele für Knöpfe.

source: List
de: Liste

source: Examples of lists.
de: Beispiele für Listen.

source: Checkbox
de: Ankreuzfeld

source: Examples of checkboxes.
de: Beispiele für Ankreuzfelder.

source: Some guiding principles to help you decide which terminology to use.
de: Einige Leitprinzipien, die Ihnen die Entscheidung bei der Wahl der Begriffe erleichtern.

source: Choosing terminology
de: Wahl der Begriffe

source: Simple
de: Einfach

source: Use non-technical, simple language. Complicated and rarely-used words should be avoided. Terms that are well-known inside the computer industry, but not in everydaylife, should be used with caution.
de: Verwenden Sie eine einfache, nicht allzu technische Sprache. Komplizierte und selten verwendete Wörter sollten vermieden werden. Gerade Begriffe, die in der Computerindustrie gängig sind, aber im täglichen Leben eher selten vorkommen, sollten sparsam und mit Vorsicht eingesetzt werden.

source: Unambiguous
de: Unzweideutig

source: Categorizing objects which look or behave in very similar ways can also confuse the user, who may not understand the subtle distinction between the categories. There is no need to choose terms for different types of window, for example.
de: Die Kategorisierung von ähnlich erscheinenden oder sich verhaltenden Objekten kann den Benutzer ebenfalls verwirren. Er könnte die marginalen Unterschiede zwischen Ihren Kategorien vielleicht gar nicht richtig erfassen. Es besteht beispielsweise keine Notwendigkeit, zwischen verschiedenen Fenstertypen zu unterscheiden.

source: If you are defining a terminology guide for your project, think about what it is necessary to define and what can be left up to the writer. Consistency in terminology is important for readers, but specifying too much makes it difficult for writers to follow your guidelines.
de: Wenn Sie in Ihrem Projekt eine Richtlinie für die zu verwendenden Begriffe anlegen, sollten Sie darüber nachdenken, was wirklich unmittelbar notwendig ist und was Sie eher dem Dokumentationsautor überlassen sollten. Konsistenz in der Verwendung von Begriffen ist für Leser sehr wohl von Bedeutung, doch wenn Sie zu vieles vordefinieren, erschweren Sie dem Dokumentationsautor, Ihren Richtlinien zu folgen.

source: Not necessarily correct
de: Nicht notwendigerweise korrekt

source: Technical correctness should not be your primary concern when choosing terminology. The important thing is describing something in a way which makes sense to users and doesn't cause confusion. It's OK to be a little bit wrong.
de: Technische Korrektheit sollte bei der Begriffswahl nicht unbedingt an erster Stelle stehen. Es ist vielmehr von Bedeutung, dass Sie Dinge so beschreiben, dass sie für den Benutzer einen Sinn ergeben und keine Verwirrung stiften. Es ist durchaus in Ordnung, ein wenig »falsch« zu schreiben.

source: Ask real users
de: Fragen Sie reale Benutzer

source: When deciding on what terminology to use, you should test it on real end-users. This will help to ensure that your choices are relevant, understandable and sensible.
de: Wenn Sie sich für Begriffe zu entscheiden haben, sollten Sie diese bei realen Benutzern testen. Dadurch können sie sicher stellen, dass Ihre Begriffe relevant, verständlich und sinnvoll sind.

source: @@image: 'media/xxx.png'; md5=THIS FILE DOESN'T EXIST
de: a

source: Terms for describing objects that the user encounters in the user interface, such as files and folders.
de: Begriffe zur Beschreibung von Objekten, denen ein Benutzer in der grafischen Benutzeroberfläche begegnet, wie Dateien und Ordner.

source: Objects in the UI
de: Objekte in der Benutzeroberfläche

source: Examples of xxx.
de: Beispiele für xxx.

source: How to describe the way the user interacts with the user interface.
de: Beschreibung der Art, wie Benutzer mit der Benutzeroberfläche interagieren.

source: Interactions
de: Interaktionen

source: Mouse and keyboard actions
de: Interaktionen mit Maus und Tastatur

source: Users should be able to distinguish between actions which they have to perform with the mouse or with the keyboard, respectively.
de: Benutzer sollten in der Lage sein, zwischen Aktionen zu unterscheiden, die sie entweder mit der Tastatur oder mit der Maus auszuführen haben.

source: This is unique for the user to decide whether he has to click a button in the UI or to press a key on his keyboard. Please don't use it as follows:
de: Dies ist eindeutig für den Benutzer, ob er einen Knopf in der Benutzeroberfläche anzuklicken oder eine Taste auf der Tastatur zu drücken hat. Bitte schreiben Sie nicht:

source: Terms to be used when referring to the major components of the desktop environment.
de: Zu verwendende Begriffe, wenn auf die Grundkomponenten der Arbeitsumgebung Bezug genommen wird.

source: Desktop components
de: Komponenten der Arbeitsumgebung

source: Workspaces, etc.
de: Arbeitsflächen usw.

source: A complete list of terminology recommendations.
de: Eine vollständige Liste von empfohlenen Begriffen.

source: Complete list of terms
de: Vollständige Begriffliste

source: Writing in an appropriate tone will help readers relate to the text.
de: Das Schreiben in einem entsprechenden Ton hilft dem Leser, Bezüge zum Text herzustellen.

source: Tone
de: Ton

source: Stuffy, overly-formal writing can bore people, but imposing your bubbly personality on people can grate. A happy medium can be found: try to sound helpful and approachable, but maintain a neutral mood.
de: Ein steifer, zu formeller Ton langweilt Ihre Leser, aber das Zurschaustellen Ihrer eigenen Persönlichkeit kann auch ätzend sein. Finden Sie die goldene Mitte: einen hilfreichen, ansprechenden Ton, aber halten Sie Ihre Texte in einer neutralen Stimmung.

source: Make the reader feel like they are being personally addressed by your writing, but don't be overly-familiar or superficially friendly.
de: Geben Sie dem Leser das Gefühl, dass er von dem, was Sie schreiben, persönlich angesprochen wird. Vermeiden Sie jedoch übertriebene Vertrautheit oder Freundlichkeit.

source: Examples
de: Beispiele

source: Here are some examples of writing in the tone we are aiming for.
de: Hier einige Beispiele dafür, welcher Ton erwartet wird:

source: Guiding principles for writing documentation.
de: Leitprinzipien zum Schreiben von Dokumentationen.

source: Style Principles
de: Stilprinzipien

source: Vigorous writing is concise. A sentence should contain no unnecessary words, a paragraph no unnecessary sentences, for the same reason that a drawing should have no unnecessary lines and a machine no unnecessary parts. This requires not that the writer make all his sentences short, or that he should avoid all detail and treat his subjects only in outline, but that every sentence tell.
de: Schreiben Sie knapp und kraftvoll. Ein Satz sollte keine unnötigen Wörter enthalten und ein Abschnitt keine unnötigen Sätze, aus dem gleichen Grund, weshalb eine Zeichnung keine unnötigen Linien und eine Maschine keine unnötigen Teile enthält. Das bedeutet allerdings nicht zwangsläufig für den Schreiber, dass alle Sätze kurz gehalten werden müssen und Details vermieden werden oder der eigentliche Zweck der Dokumentation nur in Umrissen erkennbar ist. Jeder Satz sollte sinnvoll sein und Informationen vermitteln..

source: You are human, and so are your readers
de: Sie sind ein Mensch, und Ihre Leser sind es auch

source: Write simply
de: Schreiben Sie einfach

source: Write in a way that is easy for your audience to understand. This shouldn't imply that you're writing for an unintelligent audience; rather, you're trying to save your readers unnecessary mental overhead. Simple writing is easier to understand, and the point of our technical writing is to help people to understand things.
de: Schreiben Sie so, dass es für Ihr Publikum verständlich ist. Das bedeutet keineswegs, dass Ihre Zielgruppe als unintelligent anzusehen ist oder dass Sie die ungenutzten mentalen Fähigkeiten Ihrer Leser ungenutzt lassen sollten. Einfaches Schreiben ist einfacher zu verstehen. Das Ziel Ihrer technischen Dokumentation ist es, Leuten zu helfen, Dinge auf einfache Weise zu verstehen.

source: "Simple" also means "non-technical". Use words that the reader will understand and know about, or at least be able to correctly guess the meaning of. Just because a word is widely used in the computer industry doesn't mean that real users will know what it means.
de: »Einfach« bedeutet auch »nicht-technisch«. Verwenden Sie Wörter, die der Leser kennt und versteht, oder deren Bedeutung zumindest korrekt herleiten und zuordnen kann. Nur weil ein Wort in der Computerindustrie häufig verwendet wird, müssen nicht zwangsläufig reale Benutzer verstehen, worum es dabei geht.

source: Be direct
de: Seien Sie direkt.

source: Write directly to your reader. It's fine to use "you" and "your" - there is no need to always write abstractly, or for the third person. That doesn't mean that every sentence should be addressed directly to the reader, though.
de: Sprechen Sie Ihren Leser direkt an. Wörter wie »you« und »your« sind erwünscht. Es ist nicht notwendig, abstrakt oder gar in der dritten Person zu schreiben. Allerdings muss deshalb nicht jeder Satz direkt an den Leser adressiert sein.

source: Prefer shorter sentences with fewer clauses, but keep your writing friendly and natural. Being a little terse is OK as long as the text flows well.
de: Bevorzugen Sie kürzere Sätze und Satzteile, aber halten Sie Ihren Text angenehm und natürlich. Knappheit ist in Ordnung, so lange der Textfluss erhalten bleibt.

source: You should also refrain from using flowery or excessively exuberant language. Trying to write in a poetic or learned manner can obscure the meaning of the content; too much enthusiasm can be offputting or patronizing.
de: Verzichten Sie auch auf eine allzu blumige oder überschwängliche Sprache. Eine zu poetische Schreibweise kann den eigentlichen Sinn des Inhalt in den Hintergrund schieben, und zu viel Enthusiasmus kann abschreckend und schulmeisterlich wirken.

source: Sufficient is better than complete
de: Ausreichend ist besser als vollständig

source: Write enough that the reader know what you are talking about, but not much more. There is a tendency to over-explain things in documentation, usually for reasons of completeness. It's OK to miss out bits of a topic that aren't as important or interesting. You can skim over steps that are obvious.
de: Schreiben Sie genug, um den Leser begreifen zu lassen, worum es geht, aber nicht viel mehr. Es besteht eine Tendenz, Dinge in Dokumentationen übermäßig erschöpfend zu beschreiben, wohl aus Gründen der Vollständigkeit. Es ist in Ordnung, Teile eines Themas wegzulassen, die vielleicht nicht so bedeutend oder interessant sind. Sie können Schritte überspringen, die offensichtlich sind.

source: Likewise, your choice of topics shouldn't be dictated by completeness. Do users really need a topic on starting or exiting your app? Or would it be sufficient to leave those topics out?
de: Gleichermaßen sollte die Wahl Ihrer Themen nicht von erzwungener Vollständigkeit bestimmt werden. Brauchen Benutzer wirklich Informationen darüber, wie Ihre Anwendung geöffnet oder beendet werden kann, oder wäre es sinnvoller, diese Themen wegzulassen?

source: Always think about what your intended readership is looking for before you start writing. This will help you to write something that gets straight to the heart of the matter, and fast. And if you can't think of anything that a reader might want to know about a topic, perhaps you don't really need to write that topic after all?
de: Denken Sie vor dem Schreiben darüber nach, wonach Ihr Zielpublikum suchen könnte. Dadurch trifft Ihre Hilfe vielleicht schneller und ohne Verrenkungen den Punkt. Falls Ihnen zu einem Thema nichts einfällt, was den Leser interessieren könnte, tun Sie vielleicht besser daran, dieses Thema gar nicht erst in Angriff zu nehmen.

source: Break rules if it makes for better writing
de: Weichen Sie von Regeln ab, wenn es dem Geschriebenen dient

source: Dogged adherence to rules can lead to awkward-sounding text. If it makes more sense to say something in a particular way, even if it's <em>technically</em> wrong, you should say it anyway.
de: Wenn Sie den Regeln wie ein treuer Hund immer folgen, kann das auch zu unbeholfen und holprig klingendem Text führen. Falls es sinnvoller ist, etwas in einer abweichenden Art und Weise zu beschreiben, auch wenn es <em>technisch</em> falsch ist, dann sollten Sie es trotzdem tun.

source: There is a difference <em>bad</em> grammar and <em>not-quite-correct</em> grammar, however. Avoid the former; the rules of grammar are there to help avoid ambiguity and other confusions (even if they're not perfect).
de: Es gibt einen Unterschied zwischen <em>schlechter</em> und <em>nicht ganz korrekter</em> Grammatik, wie auch immer. Vermeiden Sie das Erstgenannte. Die Regeln der Grammatik sind da, um Zweideutigkeiten und andere Unklarheiten zu vermeiden, auch wenn sie nicht perfekt sind.

source: Likewise, absolute technical correctness is vehemently <em>not</em> the aim of our technical writing. It's fine to abuse terms if doing so would make your text more understandable for the reader.
de: Gleichermaßen ist absolute technische Korrektheit <em>nicht</em> oberstes Ziel unserer technischen Dokumentationen. »Missbrauchen« Sie ruhig Begriffe, wenn es der Verständlichkeit Ihres Texts zuträglich ist.

source: How you should construct sentences.
de: Regeln zum Formulieren von Sätzen.

source: Language Conventions
de: Sprachkonventionen

source: Guidelines for writers for the GNOME platform.
de: Richtlinien für Dokumentationsautoren der GNOME-Plattform.

source: Style and Terminology
de: Stil und Begriffe

source: Writing Style
de: Schreibstil

source: Terminology
de: Begriffe

source: translator-credits
de: Mario Blättermann <mariobl@freenet.de>, 2011
